[
  {
    "ID": "37TMDA",
    "Proposal title": "Probot: Test Parallelization & Distribution with Docker and Kubernetes",
    "Session type": {
      "en": "PreRecorded-Talk"
    },
    "Track": null,
    "Abstract": "Cut the time of your tests! Probot is an open source, proof of concept project that uses Docker and Kubernetes to parallelize and distribute Robot Framework tests.",
    "Description": "Probot is an open source, proof of concept project that parallelizes and distributes Robot Framework tests. It was originally developed as a graduation project during an internship at CGI. This talk will present the proof of concept and supporting research. Probot uses multiple splitting strategies to create optimal test groups, while respecting test case dependencies. Probot is highly configurable and uses Docker and Kubernetes technologies.",
    "Duration": 20,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["AGGCAG"],
    "Speaker names": ["Merel Foekens"],
    "Room": {
      "en": "RoboConOnline"
    },
    "Start": "2024-02-28T13:30:00+00:00",
    "End": "2024-02-28T15:50:00+02:00",
    "Lessons Learned": "Participants would learn about Probot and how it was developed.",
    "Describe your intended audience": "This talk is for anyone who is interested in parallelizing and distributing their Robot Framework tests.",
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "8ZHA9G",
    "Proposal title": "Workshop about creating libraries for Robot Framework",
    "Session type": {
      "en": "Workshop - Full Day"
    },
    "Track": null,
    "Abstract": "*Creating your own libraries is a breeze* - this statement on the Robot Framework website describes pretty well, how easy and yet powerful it is to extend the framework with your own library.\r\nIn the workshop, you will learn it on real examples - starting from simple static keywords in python modules and up to implementing the dynamic library API.",
    "Description": "### Description\r\n- Learn how to create different kinds of libraries for Robot Framework and use the power of its API\r\n- Get familiar with logging and assertion options, argument types, decorators etc.\r\n- Practice in developing a library for releasing and publishing it on PyPi\r\n\r\n### Knowledge Level\r\n- Basic knowledge of Python and Robot Framework is enough for most of topics\r\n- More experience in Python would be an advantage\r\n\r\n### Workshop Agenda:\r\n1. Introduction: why creating own libraries?\r\n   - What is a library for Robot Framework?\r\n   - Some use cases\r\n   - Different kinds of libraries\r\n2. Creating a static library\r\n3. Using dynamic library API\r\n4. Hybrid libraries\r\n5. Develop and publish a library on PyPi\r\n\r\n### Preparation and Technical Requirements:\r\n- A laptop capable of running Python and Robot Framework with internet access.\r\n- Software:\r\n  - Python >= 3.5\r\n  - Robot Framework >= 4.0\r\n  - Editor (IDE) for RF and Python (e.g., VS Code), a RF plugin like RF Language Server or Robotcode is nice to have\r\n  - GitHub account for code sharing\r\n  - PyPi account for publishing",
    "Duration": 420,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["BJAPHL"],
    "Speaker names": ["Andre Mochinin"],
    "Room": {
      "en": "Workshop about creating libraries for Robot Framework"
    },
    "Start": "2024-02-06T07:00:00+00:00",
    "End": "2024-02-06T16:00:00+02:00",
    "Lessons Learned": "### Key Takeaways\r\n- Understand the possibilities to extend Robot Framework with own libraries\r\n- Learn the difference between different kinds of libraries\r\n- Get real experience creating and publishing your own library on PyPi",
    "Describe your intended audience": null,
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "983ZBV",
    "Proposal title": "The Happiness Advantage in QA",
    "Session type": {
      "en": "Talk"
    },
    "Track": null,
    "Abstract": "Unlock the power of positive thinking in QA! Discover how our attention to detail can shape a happier, more productive life. Join us to shift from bug-chasers to solution-creators, fostering collaboration and celebrating success.",
    "Description": "Have you ever wondered how your career as a QA affects your life? We testers spend our time in detecting bugs, inconsistencies, and accessibility issues. We pay a lot of attention to details, try to think of scenarios not only on how to use the software, but how to abuse it too.  We are the gate-keepers for a new feature to be released. Is the new feature secure enough? Does it meet the requirements? We constantly seek for flaws and try negative scenarios. And by doing so, we become better and better at this. We train our eyes and our minds to see the flaws. In fact, we become too good at this. Our brain is a muscle; depending on the training we provide, the better we become at this.\r\n\r\nHave you ever considered how this training might affect the way we perceive the world in general outside the software?\r\nAll this negative thinking trains our brain to think negatively. And it does not stop when the clock ticks 5pm. This way of thinking, becomes the way we perceive the world around us. The way we interact with our colleagues, family or friends. The way we perceive challenges in life. Have you heard of the “Medical students' disease“? Is a condition frequently reported in medical students, who perceive themselves to be experiencing the symptoms of a disease that they are studying. The same happens to us, QA engineers, we constantly seek for flaws.\r\nAs Shawn Achor in the book “The Happiness advantage” said: “It’s not necessarily the reality that shapes us, but the lens through which your brain views the world that shapes your reality.”\r\n\r\nHow about reversing all this negative thinking? How about instead of chasing bugs, we prevent bugs from happening by thinking more positively?\r\n\r\nIf you can raise somebody’s level of positivity in the present, then their brain experiences a happiness advantage. Your intelligence, your creativity and your energy levels rise.\r\nWe can turn our issues into opportunities. When raising an issue or writing a review, we can provide constructive feedback. Instead of focusing on the result, we can focus on the process and how we can improve our Way-Of-Working. It does not matter how many tickets we raise. What does matter, are the discussions being raised by asking the right questions, firing up discussions, documenting, searching and providing actions.\r\nInstead of testing the features being implemented by developers, think along with them while they develop; this way the product becomes more robust. We don’t need to measure success in numbers. Sometimes more is achieved by doing less. Give the space and the time to enable others to do more.\r\n\r\nWe not only see the flaws but also the successes. We work closely with the developers and we see first the beautiful implementation they delivered, the solution they found, the way they handled a problem. There are often times I am proud of the people I am working with. We should be more vocal and praise our colleagues for what they achieved.\r\nLet's embrace the happiness advantage!",
    "Duration": 30,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["ZVZHZJ"],
    "Speaker names": ["Eftychia  Thomaidou"],
    "Room": {
      "en": "RoboCon"
    },
    "Start": "2024-02-09T13:50:00+00:00",
    "End": "2024-02-09T16:20:00+02:00",
    "Lessons Learned": "Hopefully, I can enlighten them to see their daily work from a different angle. I can inspire them achieve more by changing their way of working.\r\nI will give concrete examples of how daily QA tasks, that are normally focused on the negative (bugs, flaws), can be turned into a positive training for the mind. \r\nAnd I will raise awareness of how constantly searching for bugs seriously influences the way we experience life; and what we can do to train our minds and gain the happiness advantage.",
    "Describe your intended audience": "People that work in the Tester/QA role in software development.",
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "9LD8TN",
    "Proposal title": "Advanced SeleniumLibrary and Robot Framework",
    "Session type": {
      "en": "Workshop - Full Day"
    },
    "Track": null,
    "Abstract": "Techniques and tooling to ease up web testing and automation by expert developers and maintainer of the SeleniumLibrary. If you need to beef up your Selenium tests, this is the course for you.",
    "Description": "<h3 class='mb-3 mt-2'>Outline/overview of the workshop</h2><h3 class='mb-0 mt-2'>Browser Configuration</h3>We will be taking a look at desired capabilites, Selenium options and Firefox profile. Differences between Open Browser and Create WebDriver keywords will be highlighted. Finally we will build small examples showing how to configure the browser in diffrent situations.<h3 class='mb-0 mt-2'>Advanced Debuging</h3>The course will cover when encountering flaky test(s), where to look and how to stabilise them.<h3 class='mb-0 mt-2'>Parallel Execution</h3>We'll discuss running SeleniumLibrary in parallel with pabot and Selenium grid.<h3 class='mb-0 mt-2'>API</h3>SeleniumLibrary has an public API which allows users to extend on top of the SeleniumLibrary. Here we take a look what is available in the public API.<h3 class='mb-0 mt-2'>Expanding the library</h3>Looking at different pros and cons we will talk about how to extend SeleniumLibrary as well as building a new library and the Plugin API. We will show a small exmample. And we will discuss overriding existing keywords with functionality not covered by Selenium.<h3 class='mb-0 mt-2'>EventFiringWebDriver</h3>Using and abusing EventFiringWebDriver for monitoring events and how they affect the interactions with SUT will be covered.<h3 class='mb-0 mt-2'>Page Objects</h3>What are page objects and where it might be useful.<h3 class='mb-0 mt-2'>Python Page objects verses SeleniumLibrary</h3>Looking inside of a page object library and how to build one.<h3 class='mb-0 mt-2'>Checking for time of tests</h3>We will talk about verifying and reacting to execution times of tests/keywords/suites either via tags or the separate Timer library.<h3 class='mb-0 mt-2'>Using Javascript to interact with SUT</h3>Extending SeleniumLibrary with new keywords where functionality is implemented in Javascript.<h3 class='mt-5'>Learning Outcomes</h2>At the end of the workshop, user should have broad overview of advanced features of SeleniumLibrary, web automation and ways to extend and debug test tooling.<h3 class='mt-5'>Target Audience</h3>This workshop is for people with previous hands on experience with testing in Robot Framework & SeleniumLibrary. Students should already have experience testing web applications, know how to identify locators for webelements and validate those loctors, and feel comfortable working with SeleniumLibrary. Although the course will take a measured pace through the material, students should be prepared for advanced topics that will be thoroughly explained.<br><br>This workshop will be presented in English with two presenters, both who are bi-lingual in Finnish and English.<h3 class='mt-5'>Prerequisites</h3>* All participates will need to bring a laptop preconfigured to the workshop.<br>* Particapte must have access to add and modify software on their laptops.<br>* Detailed setup instructions will be shared couple of weeks before workshop day.<br>* Configure your laptops well before the workshop day<b",
    "Duration": 420,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["JDRR8S"],
    "Speaker names": ["Ed Manlove"],
    "Room": {
      "en": "Advanced SeleniumLibrary and Robot Framework"
    },
    "Start": "2024-02-06T07:00:00+00:00",
    "End": "2024-02-06T16:00:00+02:00",
    "Lessons Learned": "See Syllabus",
    "Describe your intended audience": "This workshop is for people with previous hands on experience with testing in Robot Framework & SeleniumLibrary. Students should already have experience testing web applications, know how to identify locators for WebElements and validate those locators, and feel comfortable working with SeleniumLibrary. Although the course will take a measured pace through the material, students should be prepared for advanced topics that will be thoroughly explained.",
    "Is this suitable for ..?": "Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "ATWZKG",
    "Proposal title": "Test reporting@UnionInvestment",
    "Session type": {
      "en": "Talk"
    },
    "Track": null,
    "Abstract": "In our short presentation we want to show you our infrastructure, the tools we use and the library \"ReportModifier\".",
    "Description": "As we all see on a regular basis, the complexity of our clients' requirements is constantly increasing. To compete effectively, we need to deliver high quality results and respond quickly to our clients' needs. To do this, we need to be able to implement and deliver changes quickly. Clean test management with test automation is the key to staying ahead in our business.   \r\n\r\nEfficient testing is a key success factor for fast and effective software development. We are facing the challenge of increasing test speed and repetition rate, as well as running tests in parallel. By running tests in the cloud, we are able to launch multiple solutions in different container instances in parallel, saving execution time. In combination with Jira as a test management tool and Jenkins as a starting point, we manage the test cases that will be executed and archive the results in an audit-compliant manner. Union Investment is a government-regulated company with mandatory guidelines to test traceability. Robot Framework provides exactly this. By using robot hooks developed for us by Imbus, we can log every step in detail. However, the current tools of Robot Framework cause some problems. The high complexity of the tests and the amount of information that needs to be logged makes the final report very confusing and unreadable for colleagues who aren't testers with Robot Framework knowledge but need to know the rough test flow and result. To provide a better overview of the test content, we have developed a new library that can filter the content by message content, keyword names or even keyword paths. \r\n\r\nIn our short presentation we want to show you our infrastructure, the tools we use and the library \"ReportModifier\".",
    "Duration": 30,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["Y8HW33"],
    "Speaker names": ["Matthias Gunther"],
    "Room": {
      "en": "RoboCon"
    },
    "Start": "2024-02-09T08:15:00+00:00",
    "End": "2024-02-09T10:45:00+02:00",
    "Lessons Learned": "I show how to take the complexity out of test cases using listeners and standards. How we connect test management tools like Jira with Robot Framework, how we handle data driven test cases with Jira and what kind of reports we use for different audiences.",
    "Describe your intended audience": null,
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "B9HXJZ",
    "Proposal title": "Best Practices Using Robot Framework for Easy Real-world Project Maintenance",
    "Session type": {
      "en": "Tutorial"
    },
    "Track": null,
    "Abstract": "In our medium-sized project, we've used best practices and Robot Framework's power to minimize maintenance efforts. Easy test data management, data-driven testing even with various data items, fast and reliable test run preparation, human-readable keywords, and no need for dual script maintenance… – let us share our insights and tips!",
    "Description": "Real-world projects serve as practical touchstones for theoretical concepts. Our current project, consisting of over 2500 lines of code and nearly 1000 lines of data, is still being developed. To ensure its sustainable growth without undue effort, we chose to adopt a meticulously structured approach.\r\n\r\n<br>\r\n\r\nThankfully, Robot Framework, with its implementation of the keyword-driven testing concept, offers a wide variety of possibilities for structuring projects, be it the strict separation between human-readable test cases and their technically oriented implementations, importing data files in various formats, and the built-in differentiation of prerequisites of a test case and its implementation, to name the most useful ones.\r\n\r\nWith its mentioned features in mind, we have successfully implemented several concepts and best practices in our project. Key among them are:\r\n\r\n* the strict separation of static test data from test scripts into YAML files (but still retaining randomness of values where needed), not only promoting data reusability across different tests;\r\n* data-driven testing of similar scenarios notwithstanding different data items needed by them;\r\n* utilizing queries to obtain dynamic test data from a database system, maximizing bug discovery possibilities;\r\n* meeting the prerequisites of web tests through web services calls, vastly enhancing test preparation reliability and speed;\r\n* carefully chosen keyword names and interfaces, each with a distinct purpose, leading to diminished demands on their documentation;\r\n* a clear distinction between business keywords focused on human readability and technical keywords containing mainly implementation details; this, among others, enables people with limited technical backgrounds to assemble not only test cases but also some keywords.\r\n\r\nThis last point is of significant importance as it allows for the export of only the human-readable portions of a script into an issue-tracking system. This, in turn, enables manual execution of the script whenever needed, eliminating the need for dual maintenance of manual scripts alongside Robot Framework's automated ones.\r\n\r\nWe look forward to sharing our experiences, best practices, and tips for harnessing the full potential of not merely the highly structured approach inspired and enabled by Robot Framework's principles in a real-world project. Our goal is to inspire fellow professionals to explore the benefits of these techniques for enhancing their projects.",
    "Duration": 120,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["UTWEES", "8TSLHQ"],
    "Speaker names": [
      "Václav Fuksa",
      "Nina Břicháčková"
    ],
    "Room": {
      "en": "Eficode"
    },
    "Start": "2024-02-07T11:00:00+00:00",
    "End": "2024-02-07T15:00:00+02:00",
    "Lessons Learned": "The audience or participants will gain practical and battle-tested techniques for handling test data and designing keywords (see the bullet points in the annotation of the contribution). The overall benefits of the methods to be shared include:\r\n\r\n<br>\r\n\r\n- Easier maintenance of test data, scripts and documentation; \r\n- Increased likelihood of finding a bug;\r\n- Improved speed and reliability of the test preparation phase;\r\n- Enabling people with limited technical background to assemble both test cases and high-level keywords;\r\n- Eliminating the need for duplicate maintenance: this of both manual and automated scripts.\r\n\r\nThe relevant passages of authentic code are to be shown to the audience, especially if the presentation is accepted in tutorial format.",
    "Describe your intended audience": "The ideal audience is people with some experience in test automation (but not necessarily in Robot Framework), such as TA architects and designers and intermediate TA engineers. However, even beginners could become aware of the ideas to be presented and will be able to use a few of them in their tests.\r\n\r\n<br>\r\n\r\nPrerequisites: You do not need to bring your laptop as this is NOT a hands-on tutorial.",
    "Is this suitable for ..?": "Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "BYU9KU",
    "Proposal title": "The story of spreading the glory. How we approached the community building in Poland",
    "Session type": {
      "en": "PreRecorded-Talk"
    },
    "Track": null,
    "Abstract": "Unearth the essence of Robot Framework's strength - a vibrant community. Take a peek at our journey to foster collaboration and tackle challenges. Gain practical insights for organizing impactful events, ensuring seamless user experiences. Elevate your Robot Framework experience and strengthen cooperation with your local community!",
    "Description": "What truly defines the value of Robot Framework? Is it the cutting-edge technology? The fact that it's open source? Or perhaps, the fact that its keywords resonate like natural, human language? While all of these attributes hold true, in my perspective, the most invaluable aspect of Robot Framework is its community.\r\n\r\nWitnessing people come together, be it in developing the Robot Framework ecosystem or tackling challenges in its usage, is a truly beautiful sight. But the question arises, how do we unite this community? How can we foster greater collaboration among its users? These were the very questions that drove our initiative to increase the level of collaboration of the Polish RF community. Where did they lead us? Allow me to tell the story of how we set the wheels in motion.\r\n\r\nOur tale revolves around the Wrobocon initiative, covering various facets such as:\r\n\r\nThe motivation behind our endeavor\r\nThe process of conceiving and executing the inaugural and subsequent Wrobocon events\r\nThe hurdles we encountered\r\nOur expectations versus the actual outcome\r\nAreas where we could have improved\r\nThe pivotal factors that influenced this undertaking\r\nThe technological stack we employed\r\n\r\nWe aim to share our experiences so that anyone contemplating a similar venture can draw from our insights, ultimately creating an enhanced user experience right from their inaugural event.\r\n\r\nIn the course of this talk, I will delve into behind-the-scenes intricacies. This will serve as a resource for prospective event organizers, offering them a chance to learn from our missteps and gather inspiration. They can cherry-pick ideas that resonate with them and add their unique touch. Together, let's anticipate a future filled with even more Robot Framework events.🙂",
    "Duration": 20,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["XP3VZC"],
    "Speaker names": ["Krzysztof Żminkowski"],
    "Room": {
      "en": "RoboConOnline"
    },
    "Start": "2024-02-29T13:00:00+00:00",
    "End": "2024-02-29T15:20:00+02:00",
    "Lessons Learned": "Participants will leave with a clear roadmap for orchestrating successful conferences, armed with insights on community-building and collaboration. They'll gain firsthand knowledge from our experience in launching and evolving Robot Framework events. This session is a blueprint for creating impactful gatherings, ensuring a seamless experience for attendees, right from the inaugural event",
    "Describe your intended audience": "It is for a broad audience, for anyone how wants to be engaged in community building on whichever level (regional, country wide, globally). So the soft skill are more crucial. The level of experience in RF isn't that important, but it's good to already know some people from the community that is why I selected that this talk is for intermediate and advanced users.",
    "Is this suitable for ..?": "Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "C3JNDF",
    "Proposal title": "Robot Framework is ...",
    "Session type": {
      "en": "Talk"
    },
    "Track": null,
    "Abstract": "Robocon 2022 \"Robot Framework Is Not ...\" put forth that we needed a style guide. 2 years and several biweekly meetings later the style guide workgroup can finally unveil the official Robot Framework style guide.",
    "Description": "In this presentation we will talk about how it began, the start of the workgroup, how we made decisions on guide content (user guide, Robocop, Robotidy, folklore, etc ...), where we are today, and finally where do we want to go and who should be involved?\r\n\r\nThe presentation will offer practical examples on adoption and implementation of the style guide.\r\n\r\nFinally we need from the Robot Framework community!\r\n\r\n* More discussions\r\n\r\n* More content\r\n\r\n* More workgroup members\r\n\r\n### The style guide is a community asset, the more we treat it as such, the more authority it will gain.\r\n\r\nAttend our talk and Kelby promises more pictures of gnomes...",
    "Duration": 30,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["9BRJUX", "HL7EQT", "WG3A8G"],
    "Speaker names": ["Kelby Stine", "Guido Demmenie", "Manana Koberidze"],
    "Room": {
      "en": "RoboCon"
    },
    "Start": "2024-02-09T07:00:00+00:00",
    "End": "2024-02-09T09:30:00+02:00",
    "Lessons Learned": "This is a follow up presentation to an earlier one about developing and providing a style guide for Robot Framework. Unveiling a version 1.0 of the guide from the efforts of the work group is a moment we have been waiting for.\r\n\r\nIt will allow for new users to write cleaner code and provide clarity for existing users.",
    "Describe your intended audience": "Everybody.",
    "Is this suitable for ..?": "Beginner RF user"
  },
  {
    "ID": "DVQTFT",
    "Proposal title": "MITM Unleashed: Hacking Your Network Communication with Robot Framework",
    "Session type": {
      "en": "PreRecorded-Talk"
    },
    "Track": null,
    "Abstract": "Uncover the potential of Man-in-the-Middle (MITM) techniques in software testing. Discover how to use real-time network manipulation, empowering you with independence and flexibility in automation testing.",
    "Description": "# Introduction\r\nIn an ideal world, testing is straightforward, with every aspect of the system easily testable, automation seamless, and testing scenarios requiring no adjustments. The reality often falls short of this ideal. Testing environments may lack vital resources, leading to a reliance on developers to create stubs and mocks or manual testing.\r\nThis dependence on developers can introduce bottlenecks and dependencies, especially when working under time constraints or with uncooperative teams. What if testers could gain more control and independence in their testing scenarios? Let's explore the concept of using Man-in-the-Middle (MITM) techniques to revolutionize software testing.\r\n## The Pretend Game\r\nStubbing and mocking are established techniques in software testing. They involve manipulating specific parts of a test object to create specific testing scenarios. This is crucial when integration with external applications is impossible or when replicating desired behaviors is challenging.\r\nHowever, challenges arise when it comes to automation and parallel testing, as toggling a stub or mock on and off simultaneously is impossible.\r\n## Hacking your network: The MITM Approach\r\nMan-in-the-Middle (MITM) attacks are well-known in the cybersecurity domain for eavesdropping network communications. However, MITM techniques can be harnessed as a potent tool for software testing. This approach gives testers the ability to take control of their testing scenarios without relying on developers, external resources, or making changes to the application under test.\r\nMITM offers several advantages:\r\n### Real-time Network Manipulation\r\nMITM allows testers to intercept and manipulate requests sent by applications, enabling the simulation of various scenarios. This can be done in parallel, by proxying a single browser instance to manipulate payloads, by delaying or even blocking specific endpoints.\r\n### Backend Information Manipulation\r\nMITM is a python library that provides testers with the ability to modify backend data, ensuring that the frontend displays the desired content for testing. Testers can use MITM to simulate various scenarios and verify how the application responds to different inputs. This powerful capability enhances test coverage and can help identify potential vulnerabilities faster¬.\r\n## Versatility of MITM\r\nOne of the key strengths of MITM is its independence from the application under test. Testers can fully customize and utilize MITM according to their specific testing needs, without relying on external partners or introducing changes to the application's codebase. This versatility empowers testers to be more self-sufficient and flexible in their testing efforts.\r\n## Conclusion\r\nIn an imperfect world, software testing can be a daunting task, with dependencies on developers and external resources. Man-in-the-Middle (MITM) techniques provides testers with the independence and flexibility they need to overcome these challenges.",
    "Duration": 20,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["T7EQ8T"],
    "Speaker names": ["Mark Moberts"],
    "Room": {
      "en": "RoboConOnline"
    },
    "Start": "2024-02-29T17:00:00+00:00",
    "End": "2024-02-29T19:20:00+02:00",
    "Lessons Learned": "How to use MITM with Robot Framework\r\nReal world applications for MITM\r\nIndependence for testers",
    "Describe your intended audience": "The talk is most suited for people who use some sort of web testing, as this is the easiest implementation. The techniques can be used in various other applications though.",
    "Is this suitable for ..?": "Intermediate RF user"
  },
  {
    "ID": "EC3P3M",
    "Proposal title": "Bridging Innovation and Regulation in Embedded Software Testing with Robot Framework",
    "Session type": {
      "en": "PreRecorded-Talk"
    },
    "Track": null,
    "Abstract": "We will show how Robot Framework can be used in embedded software testing as a link between established tools and innovative solutions that make automating testing for hardware-related code a real possibility while still complying with regulatory requirements. Based on a practical solution, we examine if Robot Framework can unite both worlds",
    "Description": "Traditionally, testing each release of a microcontroller's firmware involves flashing it onto the chip, integrating it into a HIL simulation and testing it in a closed loop. To move away from this time-consuming way of testing embedded firmware, embeff developed the ExecutionPlatform. The ExecutionPlatform allows you to perform open-loop tests on your microcontroller that operate at the pin level, but without performing an entire simulation of the environment (as in system testing). The test specifies a pin behavior or calls functions in the code. As a result, functions in the code are read or the activities on the pins are evaluated. \r\n\r\nThese tests are written as Robot Framework scripts. They use Robot Keywords corresponding to the needed pins and endpoints the microcontroller sends and reads data from. After you have written your tests on your local machine, you can flash the firmware onto the chip and run the tests all via ethernet. \r\n\r\nAs firmware becomes more complex and regulatory requirements come into play, a test management tool is required to define and organise the test cases and align them with the requirements and standards. The established TestBench tool provides a modular approach with pre-defined macros for building test cases. It is also possible to generate and export Robot Framework scripts. They can be executed and immediately imported back into the database with the corresponding test results. \r\n\r\nThis can now be taken a step further with the ability to access, export and execute tests via a REST API call to the TestBench server. This could be triggered by a code change and an automatic build of the binary.",
    "Duration": 20,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["FYLY7K", "JEJN7Y"],
    "Speaker names": ["Daniel Penning", "Max-Vincent Steck"],
    "Room": {
      "en": "RoboConOnline"
    },
    "Start": "2024-02-28T15:30:00+00:00",
    "End": "2024-02-28T17:50:00+02:00",
    "Lessons Learned": "Participants will learn which possibilities the use of Robot Framework offers in the ebedded area and how an exemplary solution can be built up and used step by step.",
    "Describe your intended audience": null,
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "ECPABL",
    "Proposal title": "Containerize your robots and run them on Kubernetes",
    "Session type": {
      "en": "Workshop - Full Day"
    },
    "Track": null,
    "Abstract": "Harnessing Kubernetes to run Robot Framework tests in containers offers a practical solution for scaling your test executions in a cloud environment. This workshop will provide hands-on guidance for running Robot Framework within Docker containers and mastering the fundamentals of Kubernetes, the container orchestration platform.",
    "Description": "The advent of the container orchestration platform Kubernetes has revolutionized the development of modern software architectures and the seamless migration of containerized workloads to the cloud. The intricacies of relocating your test infrastructure and test execution to the cloud may seem daunting, but the rewards are profound when you harness the scalability and resource management capabilities of Kubernetes. Join us for an enriching workshop at Robocon 2024, where we'll explore the potential of Kubernetes in optimizing your testing.\r\n\r\n<br>\r\n\r\nIn this hands-on workshop, you'll learn how to containerize your RobotFramework test executions effectively. We'll work together to create Kubernetes manifests for defining and managing these executions. Participants will collaborate within a shared Kubernetes cluster environment, promoting practical knowledge sharing and discussions around diverse approaches. Our focus will be on real-world best practices for running tests in cloud environments, with a specific emphasis on utilizing Kubernetes features.\r\n\r\nAll workshop details and materials will be shared in an open-source github repository.",
    "Duration": 420,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["FJSLFM", "C9NDBA"],
    "Speaker names": ["Markus Stahl", "Nils Balkow-Tychsen"],
    "Room": {
      "en": "Containerize your robots and run them on Kubernetes"
    },
    "Start": "2024-02-06T07:00:00+00:00",
    "End": "2024-02-06T16:00:00+02:00",
    "Lessons Learned": "In the first quarter of the workshop, we’ll look into containerizing Robot Framework tests. We’ll look at a simple example as well as the ppodgorsek/robot-framework image and on how to customize images for specific test dependencies. Over all we’ll dive deep into the capabilities of Dockerfiles https://docs.docker.com/engine/reference/builder/.\r\n\r\n<br>\r\n\r\nIn the second quarter, we’ll learn about Kubernetes and go through the creation of a web application via Kubernetes manifest files. We’ll learn about different Kubernetes objects like deployments, pods, volumes, jobs and cronjobs and we’ll use kubectl to analyze and edit them.\r\n\r\n<br>\r\n\r\nIn the third quarter, we’ll apply the learnings from the previous two quarters and build a Kubernetes manifest for a Robot Framework test run. As part of this we’ll also explore different ways of exposing the test reports from the ephemeral test run in the cluster.\r\n\r\n<br>\r\n\r\nIn the last quarter, we’ll discuss scaling of test runs in Kubernetes. We’ll run a few different scenarios with pabot and learn how to investigate the resource consumption in the cluster. As part of this we’ll also discuss limits of pabot and how upcoming ecosystem projects are planning to address those.\r\n\r\n<br>\r\n\r\nOptionally, when time allows we can look into the KubeLibrary and see how it can be utilized to harden your test runs on top of Kubernetes.",
    "Describe your intended audience": "The intended audience for this workshop are test engineers working on test infrastructure. None the less also RPA users can use the knowledge provided to run RPA tasks in their cloud environments.",
    "Is this suitable for ..?": "Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "ECYJEF",
    "Proposal title": "3..2..1..BEEEEEP! Microwaving Robot Framework",
    "Session type": {
      "en": "Talk"
    },
    "Track": null,
    "Abstract": "Promoting re-usability and abstraction for a multi-interface telecommunication product. Employing one keyword per action offers consistent outputs across interfaces, versatile and reusable single-functionality tests and simplified user focus on keyword-based actions ensuring code simplicity.",
    "Description": "Microwave backhaul is a method used in telecommunications to transmit data, voice and other signals through radio frequencies. Our portfolio includes hardware units with diverse functionalities that can be flexibly configured to create various network/radio topologies. In addition to this, all units support the following user access interfaces: webct (web page), snmp and ongoing integration of netconf, REST and cli. Testing should cover frontend, backend, and end-to-end functionalities for each hardware unit, spanning all interfaces and multiple topological setups. In order to mitigate these complexity issues, we introduced an approach to overload keywords with custom python annotations. In this talk, we'll explore hardware testing challenges as well as our framework structure.\r\nThe most significant principles in our framework are: <br>\r\n\r\n•\t**One Keyword Approach**\r\nEvery action on our product is associated with a specific keyword that will apply it to the access interface given as input argument. Since multi-interfaces are supported, it is ensured that each keyword will return consistent outputs.<br>\r\n\r\n•\t**Test Reusability Across Interfaces**\r\nBy extending the above principle from keyword-level to testcase-level, we achieve test uniformity across interfaces, saving development time and resources otherwise spent on separate test case creation.<br>\r\n\r\n•\t**Test Adaptability Based on Network Topology**\r\nProduct functionality should be tested across different hardware units and different network topologies. Tests designed for one network topology can be adjusted to similar topologies. The system-under-test is described in a Python class variable file with each test dynamically loading network parameters from this file during runtime. Changing the python file, reuses the test to another hw unit and topology.<br>\r\n\r\n•\t**User Experience Simplification and Code Readability**\r\nTo enhance user focus on keyword-driven actions, common interface actions are hidden by adding interface-related parameters as function arguments. Python decorators facilitate these principles by mapping system-dependent variables to their values and executing required actions for each interface.<br>\r\n\r\n•\t**Extendable to new interfaces**<br>\r\nSupport for new user interfaces can be incorporated just by implementing the interface python functions and due to one-keyword approach and test adaptability, no new tests need to be re-written to test existing functionality!<br>",
    "Duration": 30,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["VWUYL7"],
    "Speaker names": ["Stavroula Ventoura"],
    "Room": {
      "en": "RoboCon"
    },
    "Start": "2024-02-08T09:40:00+00:00",
    "End": "2024-02-08T12:10:00+02:00",
    "Lessons Learned": "What i have learned?\r\n* how to use decorators for custom keywords . \r\n* how to test actual hw, and how sensitive it is\r\n*  how hard it is to combine different interfaces\r\n*  how to automate also peripheral units (instruments needed for our tests)\r\n* how to reuse code of the two existing frameworks to unite to one\r\n* how to make the framework user-friendly and appealing to all testers - automated and manual - and clear to all, despite their automation knowledge. \r\n* how to continuously improve the user-experience and the framework capabilities.",
    "Describe your intended audience": null,
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "EJTPFY",
    "Proposal title": "Automated Generation of Acceptance Tests of Process-Aware Information Systems (PAIS)",
    "Session type": {
      "en": "PreRecorded-Talk"
    },
    "Track": null,
    "Abstract": "Test coverage in customizable PAIS can be challenging due to complexity and variability of process models. Automated generation and execution of test cases based on the BPMN that underlies the system is promising. A solution that executes acceptance tests through the automation of the user interface of a Camunda-based webapp using RF is presented.",
    "Description": "A model-based testing strategy is proposed, using BPMN models and some reference architecture specifications as input to generate RF scripts that automate a comprehensive User Acceptance Test procedure of a customizable PAIS.\r\nThe present PAIS, called AKIP Platform, is the result of the effort of researchers from the AgileKip group. It is based on the Open Source Community Edition Camunda 7, and uses JHipster to scaffold a fully customizable process-aware webapp.\r\nThe AKIP Platform was built by developers and researchers from the AgileKip group, who are devoted to facilitate Process/Workflow Automation initiatives based on code generation techniques, for developers, professors and researchers willing to disseminate and build Process-Aware Information Systems based on known technologies such as BPMN, Java and Javascript.\r\nLeveraging on RF, i.e. RPA, to mimic user interactions allows for reducing the need for testers to manually input PAIS-related information when handling user forms, while increasing test coverage and enabling regression testing.\r\nCurrently, there's a prototype developed, which is able to interpret the BPMN and generate executable test cases using RF for the user interface automation. It utilizes the Faker library to generate random input data and Selenium for the webapp automation.\r\nIt is also being explored the generation of such test cases using the Gherkin syntax, in an effort to aproximate documentation and test planning.",
    "Duration": 20,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["KQR9AE"],
    "Speaker names": ["Tales Mello Paiva"],
    "Room": {
      "en": "RoboConOnline"
    },
    "Start": "2024-02-29T16:30:00+00:00",
    "End": "2024-02-29T18:50:00+02:00",
    "Lessons Learned": "Exploring and diving deeper into the interplay between RF and Camunda, i.e. RPA and BPMS.\r\nPractical examples on how to generate and execute test cases based on the BPMN of a process model.\r\nUsing Gherkin to bridge the gap between a PAIS main artifact, the process model, and the test planning.",
    "Describe your intended audience": "Business Process Management enthusiasts, QA engineers, RPA enthusiasts.",
    "Is this suitable for ..?": "Beginner RF user"
  },
  {
    "ID": "FDD8CK",
    "Proposal title": "Opening the Conference (Live)",
    "Session type": {
      "de": "Keynote",
      "en": "Keynote"
    },
    "Track": null,
    "Abstract": "Pekka will deliver an in-depth presentation on the latest release of Robot Framework, along with ideas for future development.\r\n\r\nMiikka and René will also discuss and present the Robot Framework Foundation and its community.",
    "Description": "Pekka will deliver an in-depth presentation on the latest release of Robot Framework, along with ideas for future development.\r\n\r\nMiikka and René will also discuss and present the Robot Framework Foundation and its community",
    "Duration": 50,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["JUQN3X", "FQJRHW", "D3ZLT3"],
    "Speaker names": [
      "René Rohner",
      "Miikka Solmela",
      "Pekka Klärck"
    ],
    "Room": {
      "en": "RoboConOnline"
    },
    "Start": "2024-02-28T10:00:00+00:00",
    "End": "2024-02-28T13:00:00+02:00",
    "Lessons Learned": "Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.\r\nWhy do we use it?\r\n\r\nIt is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout. The point of using Lorem Ipsum is that it has a more-or-less normal distribution of letters, as opposed to using 'Content here, content here', making it look like readable English. Many desktop publishing packages and web page editors now use Lorem Ipsum as their default model text, and a search for 'lorem ipsum' will uncover many web sites still in their infancy. Various versions have evolved over the years, sometimes by accident, sometimes on purpose (injected humour and the like).",
    "Describe your intended audience": null,
    "Is this suitable for ..?": "Beginner RF user"
  },
  {
    "ID": "H9BAHW",
    "Proposal title": "Closing the Conference",
    "Session type": {
      "de": "Keynote",
      "en": "Keynote"
    },
    "Track": null,
    "Abstract": "Closing words\r\n  Game Winners Announcement\r\n  After-Party Invitation",
    "Description": "Closing words\r\n  Game Winners Announcement\r\n  After-Party Invitation:\r\n        Unwind and Connect: Relax, network, and enjoy in a casual, festive atmosphere.\r\n        Entertainment: Great music and delightful refreshments.\r\n        Socialize: An opportunity to mingle and celebrate the day's success.",
    "Duration": 20,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["HTDUSJ", "FQJRHW"],
    "Speaker names": ["René Rohner", "Miikka Solmela"],
    "Room": {
      "en": "RoboCon"
    },
    "Start": "2024-02-09T14:20:00+00:00",
    "End": "2024-02-09T16:40:00+02:00",
    "Lessons Learned": "Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.",
    "Describe your intended audience": null,
    "Is this suitable for ..?": "Advanced RF user"
  },
  {
    "ID": "HSDAHH",
    "Proposal title": "RFSwarm how it came about and where it's going",
    "Session type": {
      "en": "Talk"
    },
    "Track": null,
    "Abstract": "An overview if RFSwarm - a performance testing tool with robot framework\r\n- what it is and why it's important different to other performance testing tools\r\n- why I created it\r\n- where it's at now\r\n- future plans\r\n- Q&A",
    "Description": "- what it is and why it's important different to other performance testing tools\r\nIn this part of the talk I'll tell about the tool, what its for, what I believe the benefits are, why people might use RFSwarm over other performance test tools, and the problems I believe RFSwarm solves for people.\r\n\r\n- why I created it\r\nIn this section I'll give a little bit about my background, ways I'd attempted to solve these problems before RFSwarm, and why I ended up creating RFSwarm.\r\n\r\n- where it's at now\r\nIn this section I'll give an overview of where RFSwarm is today\r\n\r\n- future plans\r\nIn this section I'll talk about the planned features and give a rough idea of the roadmap, things that I foresee that could change the roadmap.\r\n\r\n- Q&A\r\nIn this section I'll open for people to ask any questions they want about RFSwarm and do my best to answer them.",
    "Duration": 30,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["UHHRL8"],
    "Speaker names": ["Dave Amies"],
    "Room": {
      "en": "RoboCon"
    },
    "Start": "2024-02-09T12:00:00+00:00",
    "End": "2024-02-09T14:30:00+02:00",
    "Lessons Learned": "- Difficulties for an automation team doing test automation with one tool/language and then having to use another completely different tool & language for performance testing, how this becomes easier with RFSwarm.\r\n- Learn that with RFSwarm they can use Robot Framework for performance testing as well\r\n- Benifits to the Test team when all the test automation disciplines are all using the same scripting language\r\n\r\nI expect to spend 5 min on each of the 5 sections I previously mentioned to bring the talk to 25 min.",
    "Describe your intended audience": null,
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "JHXEQQ",
    "Proposal title": "Robot Framework as Compliance Enabler",
    "Session type": {
      "en": "Talk"
    },
    "Track": null,
    "Abstract": "Unlock Compliance with Robot Framework! Join my talk to learn how this versatile automation tool empowers teams to streamline and automate manual documentation processes, ensuring seamless adherence to industry regulations. Get practical tips on how to harness Robot Framework's potential in your compliance journey with automated reports creation!",
    "Description": "In today's fast-evolving tech landscape, compliance with rules and standards is a universal priority, extending beyond regulated industries like banking and pharmaceuticals. Robot Framework, a versatile automation tool, is reshaping how we ensure our software meets production-ready criteria.\r\n\r\nThis talk aims to demystify compliance, highlighting its critical importance in modern software development. Failing to meet compliance can have wide-ranging consequences, from legal ramifications to reputational damage.\r\n\r\nAttendees will gain practical insights into how Robot Framework integrates into automation pipelines, facilitating compliance validation, and how to generate comprehensive, user-friendly reports. These serve as tangible proof of compliance, invaluable for audits and regulatory assessments. Hands-on guide to report generation will be demonstrated, ensuring that the product is well-prepared for any compliance checks that come along in the development journey.\r\n\r\nThis talk is an essential guide for navigating the intersection of compliance and automation in the software engineering landscape, making sure you're building for the future with confidence. Join me on this journey towards a future where compliance is not a hurdle, but an enabler of innovation.",
    "Duration": 30,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["SZE8YE"],
    "Speaker names": ["Kateřina Hošová"],
    "Room": {
      "en": "RoboCon"
    },
    "Start": "2024-02-08T12:10:00+00:00",
    "End": "2024-02-08T14:40:00+02:00",
    "Lessons Learned": "Participants will learn how to integrate Robot Framework as a testing tool into development process, meaning automation pipelines, and how to create human-readable reports, that will be incorporated into SDLC documentation. They will also learn what is compliance, SDLC process and how testing fits into the bigger picture.",
    "Describe your intended audience": "Any test engineer that works on a project that is following SDLC compliance processes, or anyone who wants to learn tips on easily readable test reports (for both technical and business sides).",
    "Is this suitable for ..?": "Intermediate RF user"
  },
  {
    "ID": "JRSGDD",
    "Proposal title": "Enhancing Test Insights: A Deep Dive into Robot Framework Reporting",
    "Session type": {
      "en": "Tutorial"
    },
    "Track": null,
    "Abstract": "Join our tutorial, \"Deep Dive into Robot Framework Reporting,\" where we'll empower you to transform test reports into decision-making tools. Uncover hidden insights, use Allure, ReportPortal, and Grafana, and gain the ability to drive quick, informed actions through crystal-clear data.",
    "Description": "Welcome to our tutorial, \"Enhancing Test Insights: A Deep Dive into Robot Framework Reporting.\" In this immersive session, we'll embark on a journey to transform your test reports into invaluable assets for making informed decisions. \r\n\r\n<br>\r\n\r\nExplore the depths of Robot Framework reporting, uncover hidden insights, and unlock the power of Allure, ReportPortal, and Grafana . Join us to elevate your reporting skills and gain the ability to drive swift and informed actions through crystal-clear insights. Don't miss this opportunity to become a master of test reporting!",
    "Duration": 120,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["T7BUER"],
    "Speaker names": ["Many Kasiriha"],
    "Room": {
      "en": "RoboConOnline"
    },
    "Start": "2024-02-27T08:00:00+00:00",
    "End": "2024-02-27T12:00:00+02:00",
    "Lessons Learned": "Collecting and visualizing Result History with different tools.\r\nGood practices in Robot Framework to improve reporting.\r\nParsing Test Results the right way (using the API).\r\nUnderstand usage of 3rd party reporting solutions like Allure, Grafana and ReportPortal with Robot Framework",
    "Describe your intended audience": "People who know Robot Framework and who want to improve their reports.",
    "Is this suitable for ..?": "Intermediate RF user"
  },
  {
    "ID": "JSCEPN",
    "Proposal title": "How Robot Framework has changed the RPA market, and what we did with it",
    "Session type": {
      "en": "PreRecorded-Talk"
    },
    "Track": null,
    "Abstract": "The presentation explores challenges in SME RPA projects, emphasizing Robot Framework's advantages and sharing insights on overcoming obstacles for an RPA agency",
    "Description": "As is the case in many countries, in the Netherlands the SME market is the true engine of the economy. This is also where most of the workforce is active. Although RPA was always an interesting solution for them technically, the investment in the software and the hiring of the required knowledge made it non-viable for most companies. \r\n\r\nWhat we are now experiencing is a true revolution in the RPA market, due to the evolution of RPA software. We have embraced Robot Framework through Robocorp to expand our offerings and start helping the SME market at a large scale for the first time. \r\n\r\nIn our talk we would like to take the visitors on a journey through the challenges involved in RPA projects in the SME markets, such as budgeting, technical and process knowledge within companies and the impact RPA robots have on these organizations. \r\n\r\nWe will be highlighting the advantages of doing this with robot framework and how it has helped us create a viable RPA agency and share the main obstacles we had to overcome (and are still dealing with).",
    "Duration": 20,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["CPN7VC", "ZGZ7WT"],
    "Speaker names": ["Sam van der Wagen", "Jasper Verbunt"],
    "Room": {
      "en": "RoboConOnline"
    },
    "Start": "2024-02-28T15:00:00+00:00",
    "End": "2024-02-28T17:20:00+02:00",
    "Lessons Learned": "- Difference between RPA projects in large and SME companies\r\n- Advantages of using Robot Framework as language for RPA projects in SME companies\r\n- Hurdles to overcome in projects with SME companies\r\n- Challenges in setting up an RPA agency",
    "Describe your intended audience": "Developers / agencies interested in use of Robot Framework for custom RPA projects",
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "JSZTRJ",
    "Proposal title": "Open-source RPA stack in the bank",
    "Session type": {
      "en": "Talk"
    },
    "Track": null,
    "Abstract": "There are some crucial questions at the beginning of RPA implementaion. No-code, low-code or high-code RPA tool? We are developers and we love high-code tools! What will be the cost of implementation? Is there anything like open-source RPA tool? Yes, there is! The answer is Robot Framework.",
    "Description": "There are some crucial questions at the beginning of RPA implementaion. No-code, low-code or high-code RPA tool? We are developers and we love high-code tools! What will be the cost of implementation? Is there anything like open-source RPA tool? Yes, there is! The answer is Robot Framework.  \r\n \r\nBanks are specific institutions with hundreds of applications that are built on different technologies. You should find the right tool for automation routine, repetitive and manual tasks. Robot Framework and stack around it can handle that without any extra costs. In the end RPA platform is not only about automation tool. There is a need of robots orchestration, building run-time environments and so on. We will look at how it can be done with mainly open-source tools and how to succeed in everyday operation.",
    "Duration": 30,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["LYEHWU"],
    "Speaker names": ["Patrik Zakovič"],
    "Room": {
      "en": "RoboCon"
    },
    "Start": "2024-02-09T08:45:00+00:00",
    "End": "2024-02-09T11:15:00+02:00",
    "Lessons Learned": "Inspiration how RPA platform can be build with open-source stack a how to automate different type of technologies with RF and its libraries.",
    "Describe your intended audience": null,
    "Is this suitable for ..?": "Beginner RF user"
  },
  {
    "ID": "JXBLTV",
    "Proposal title": "Integrating Robot Framework with Generative AI and Jira",
    "Session type": {
      "en": "Workshop - Full Day"
    },
    "Track": null,
    "Abstract": "Explore the synergy of Generative AI and Robot Framework via Listener API in this hands-on workshop! Discover how to enrich Robot Framework outputs and logs, automate Jira bug/task creations for failed test cases, and tap into ChatGPT for enhanced test insights. Using existing Python libraries, dive into seamless integrations, unlocking a new dimen",
    "Description": "Post lunch, the workshop will shift its focus towards integrating Jira with Robot Framework, building on top of the listeners and ChatGPT integration from the morning session. Leveraging existing Python libraries, attendees will learn how to automate the creation of bugs/tasks in Jira for failed test cases directly from Robot Framework, again utilizing the Listener API. \r\n\r\n<br>\r\n\r\nBy the end of the workshop, attendees will have a well-rounded understanding and hands-on experience on how to leverage the Listener API for integrating ChatGPT and Jira with Robot Framework, broadening the horizon of what's achievable with Robot Framework Listeners API.",
    "Duration": 420,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["8U3B3T"],
    "Speaker names": ["David Fogl"],
    "Room": {
      "en": "Integrating Robot Framework with Generative AI and Jira"
    },
    "Start": "2024-02-06T07:00:00+00:00",
    "End": "2024-02-06T16:00:00+02:00",
    "Lessons Learned": "TBA",
    "Describe your intended audience": null,
    "Is this suitable for ..?": "Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "K7ZSXM",
    "Proposal title": "How to create a successful Robot Framework automation project",
    "Session type": {
      "en": "Talk"
    },
    "Track": null,
    "Abstract": "Many people start automation projects with poor knowledge about the product they are automating or they start in a rush because of the desire to advance quickly. Without a propper organisation and strategy in mind, this can lead to bad/inconsistent implementations that become more costly and time consuming to fix once the project is ongoing.",
    "Description": "This will be a presentation about:\r\n- Things to consider before starting an automation project\r\n- How to organise and structure the project for best performance and scalability\r\n- What are the good practices to use along the development process\r\n- Develop with stability and scalability in mind\r\n...\r\nMore awesome tips and tricks to use along the automation project development",
    "Duration": 30,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["78DPXU"],
    "Speaker names": ["Liviu Avram"],
    "Room": {
      "en": "RoboCon"
    },
    "Start": "2024-02-09T09:30:00+00:00",
    "End": "2024-02-09T12:00:00+02:00",
    "Lessons Learned": "This is a presentation for absolute beginners, who will most likely learn a lot of new stuff but also for experienced Robot Framework users who might discover some new things",
    "Describe your intended audience": "Mostly beginners but more advanced users can benefit aswell",
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "K8W3WJ",
    "Proposal title": "Am I good enough for open source?",
    "Session type": {
      "en": "PreRecorded-Talk"
    },
    "Track": null,
    "Abstract": "Have you ever thought about contributing to Open Source? If you haven't done so because you doubt your abilities. This is the talk for you! Everybody can help and every little bit helps.\r\nJoin me and discover how to get started and overcome your doubts. Let's get you contributing to Open Source projects!",
    "Description": "Inspired by a talk from RoboCon 2023 where Ed Manlove asked for help with SeleniumLibrary I walked up to him and asked how I can contribute. What I found out is that the people behind all this cool Robot Framework code are regular humans just like you and me. I also found out that there are many ways to contribute, not just by writing code.\r\n\r\nIn my talk I will share my experience becoming a first time contributor to Robot Framework and show you all the different unexpected ways you can contribute to Open Source. If I can do it, you can do it too!",
    "Duration": 20,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["GZRASZ"],
    "Speaker names": ["Yuri Verweij"],
    "Room": {
      "en": "RoboConOnline"
    },
    "Start": "2024-02-29T15:00:00+00:00",
    "End": "2024-02-29T17:20:00+02:00",
    "Lessons Learned": "There are many ways to contribute to Open Source that the participants may not have thought about. For instance:  reviewing, running tests, discussing new features, etc.\r\nI'll also help participants get over their fear of contributing or getting in contact with Open Source teams.",
    "Describe your intended audience": null,
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "KAKUQN",
    "Proposal title": "Ecosystem Project Review",
    "Session type": {
      "de": "Keynote",
      "en": "Keynote"
    },
    "Track": null,
    "Abstract": "During the fall of 2023, we will have several Ecosystem projects. \r\n\r\nLet's see what came out of them!",
    "Description": "During the fall of 2023, we will have several Ecosystem projects. \r\n\r\nLet's see what came out of them!\r\n\r\nProjects:\r\nAdd expected conditions to selenium library\r\nDoing unloved tasks in Browser lib (fixing Bugs, Updating API, writing Docs)\r\nRobotCode: Road to Version 1.0\r\nSeleniumLibraryToBrowser migration helper\r\nRobotFramework Gherkin Parser - Integration of Gherkin into RobotFramework\r\nRIDE project - Robot Framework 6.1 features support\r\nRobotLab",
    "Duration": 50,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": [],
    "Speaker names": [],
    "Room": {
      "en": "RoboConOnline"
    },
    "Start": "2024-02-29T10:00:00+00:00",
    "End": "2024-02-29T13:00:00+02:00",
    "Lessons Learned": "Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.",
    "Describe your intended audience": null,
    "Is this suitable for ..?": "Advanced RF user"
  },
  {
    "ID": "KHMASZ",
    "Proposal title": "Next-Gen Pipeline Journey: Elevate your skills with Robot Framework",
    "Session type": {
      "en": "Workshop - Full Day"
    },
    "Track": null,
    "Abstract": "Unlock the power of Robot Framework and CI/CD pipelines with us! Dive in with an exciting game, perfecting pipelines and sharing experiences. Let's build scalable, reliable, and adaptable pipelines in GitLab together. Our Journey, your decisions! Join the workshop and transform your skills.",
    "Description": "The workshop's primary objective is to disseminate knowledge about Robot Framework and CI/CD pipeline topics. We begin with an engaging card game focused on designing the perfect pipeline using a provided example to facilitate knowledge and experience sharing. Our discussions will delve into the creation of specialized pipelines for integration, deployment, and the delivery of high-quality test suites.\r\n\r\n<br>\r\n\r\nSubsequently, we will immerse ourselves in a dedicated environment that includes routers and servers, allowing us to create real-life project scenarios within the confines of the workshop. Here, we will construct scalable, reliable and adaptable pipelines within the GitLab environment, where runners are dynamically managed and configured for specific purposes. During the workshop there will be many possible path to follow so we will discuss and decide together.",
    "Duration": 420,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["R9UP8V"],
    "Speaker names": ["Lukasz"],
    "Room": {
      "en": "Next-Gen Pipeline Journey: Elevate your skills with Robot Framework"
    },
    "Start": "2024-02-06T07:00:00+00:00",
    "End": "2024-02-06T16:00:00+02:00",
    "Lessons Learned": "1. CI/CD pipeline design - we will play the game where real life solutions are to design\r\n2. Robot Framework proficiency - we will go through topics like building the dynamic testing environment for Robot, reporting in multiple ways, usage of database testing, API testing and UI testing but pure testing is not the essential of the workshop\r\n3. Integration and Deployment strategies  and assumptions\r\n4. Knowledge how to delivery high quality tests \r\n5. GitLab Pipeline Management - during the workshop we will create dynamically managed runners and use them for the short term\r\n6. How to design pipeline at AWS increasing productivity of teams and make time to market shorter and cheaper using dedicated approach designed and introduced by me in a few projects",
    "Describe your intended audience": "This workshop was designed for the people having the basic knowledge about Robot Framework and basic knowledge about Bash/Powershell scripts, how to build projects, how to run tests from the command line etc.",
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user"
  },
  {
    "ID": "KN7GTB",
    "Proposal title": "Unlocking the Power of RobotFramework: An Introductory Tutorial",
    "Session type": {
      "en": "Tutorial"
    },
    "Track": null,
    "Abstract": "Embark on an exhilarating 2-hour adventure with us as we dive deep into RobotFramework - test automation tools gem. From the thrill of the initial installation to the adrenaline-pumping basics, our tutorial equips you to unleash the full potential of RobotFramework. Get ready to supercharge your automation journey and emerge as a testing champion!",
    "Description": "<h2>Tutorial Agenda:</h2>\r\n  <ol>\r\n    <li>\r\n      <strong>Introduction to RobotFramework (30 minutes):</strong>\r\n      <ul>\r\n        <li>Explore the basics of test automation and the importance of RobotFramework in modern software testing.</li>\r\n        <li>Learn about the key features and advantages of RobotFramework.</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <strong>Installation and Setup (20 minutes):</strong>\r\n      <ul>\r\n        <li>Walk through the step-by-step process of installing RobotFramework on your system.</li>\r\n        <li>Configure your environment to kickstart your automation journey.</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <strong>Creating Your First Test (20 minutes):</strong>\r\n      <ul>\r\n        <li>Build your first test case from scratch, incorporating keywords and test data.</li>\r\n        <li>Understand the structure of a RobotFramework test suite.</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <strong>Executing Tests (20 minutes):</strong>\r\n      <ul>\r\n        <li>Discover various methods of running test cases, including command-line execution.</li>\r\n        <li>Interpret test execution results and reports.</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <strong>Keyword Libraries and Custom Keywords (30 minutes):</strong>\r\n      <ul>\r\n        <li>Explore built-in and external libraries, and understand how to leverage them in your test cases.</li>\r\n        <li>Create custom keywords to meet the unique requirements of your test scenarios.</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <strong>Variable Management (20 minutes):</strong>\r\n      <ul>\r\n        <li>Learn how to handle variables to make your tests more dynamic and reusable.</li>\r\n        <li>Understand variable scopes and the RobotFramework variable syntax.</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <strong>Test Data Management (20 minutes):</strong>\r\n      <ul>\r\n        <li>Master the art of managing test data and test data files.</li>\r\n        <li>Use data-driven testing to test various scenarios with a single test case.</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <strong>Handling Test Environments (15 minutes):</strong>\r\n      <ul>\r\n        <li>Discover strategies for managing test environments and configurations.</li>\r\n        <li>Handle setup and teardown tasks efficiently.</li>\r\n      </ul>\r\n    </li>\r\n    <li>\r\n      <strong>Best Practices and Tips (20 minutes)</strong>\r\n  </ol>\r\n\r\n  <h2>Tutorial Objective:</h2>\r\n  <p>This tutorial is designed for individuals with little to no experience with RobotFramework. Our goal is to equip you with the fundamental knowledge and practical skills required to start your test automation journey. Whether you're a tester, developer, or a quality assurance professional, you'll leave this tutorial with a solid understanding of how to create and maintain test suites, handle test data, and integrate RobotFramework into your projects.</p",
    "Duration": 120,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["BXEQAQ"],
    "Speaker names": ["Igor Czyrski"],
    "Room": {
      "en": "Eficode"
    },
    "Start": "2024-02-07T08:00:00+00:00",
    "End": "2024-02-07T12:00:00+02:00",
    "Lessons Learned": "By the end of this tutorial, participants will be equipped to:\r\n\r\n<br>\r\n\r\n- Install and set up RobotFramework.\r\n- Create and execute basic test cases.\r\n- Efficiently manage variables, test data, and test environments.\r\n- Harness the power of keyword libraries and custom keywords.\r\n- Follow best practices for sustainable test automation.\r\n\r\nThis tutorial is designed to bring practical value to attendees by providing them with the skills and knowledge to confidently use RobotFramework for their test automation projects. It emphasizes hands-on experience, ensuring that participants are well-prepared to tackle real-world automation challenges and deliver high-quality software.",
    "Describe your intended audience": "This tutorial is designed for individuals with little to no experience with RobotFramework. Our goal is to equip you with the fundamental knowledge and practical skills required to start your test automation journey. Whether you're a tester, developer, or a quality assurance professional, you'll leave this tutorial with a solid understanding of how to create and maintain test suites, handle test data, and integrate RobotFramework into your projects.\r\n\r\n<br>\r\n\r\nTutorial prerequisites:\r\n- computer with Python (>3.10) installed\r\n- IDE of choice",
    "Is this suitable for ..?": "Beginner RF user"
  },
  {
    "ID": "KTU8MK",
    "Proposal title": "Using RobotFramework for Embedded Driver Testing - A field report",
    "Session type": {
      "en": "Talk"
    },
    "Track": null,
    "Abstract": "In 2020 we decided to use RobotFramework as an interface to our generic Embedded Test Platform.\r\nSince then our users check their hardware related microcontroller code only through Robot test sequences.\r\n\r\nThis talk will highlight some of the technical challenges we faced and what we learned in resolving them.",
    "Description": "The talk will briefly explain why we turned to RobotFramework and what we need it for. Then these technical challenges are covered:\r\n\r\n- Access a network-based test device\r\n- Flexible keywords based on a user-defined configuration\r\n- Usability through VS Code and plugins \r\n- Concurrent access und authentication\r\n\r\nI will also share what seems to be missing in RobotFramework / Libraries / Ecosystem from our point of view.\r\nThe conclusion will give a definitive answer to the question if our decision to use RobotFramework as an interface turned out to be a good one or not.\r\n\r\nDaniel Penning studied EE and worked in industry and safety-critical embedded projects before founding embeff. As a conference speaker he regularly shares his passion for high-quality embedded development. At embeff he works with customers to put innovative solutions for embedded test automation to practical use.",
    "Duration": 30,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["FYLY7K"],
    "Speaker names": ["Daniel Penning"],
    "Room": {
      "en": "RoboCon"
    },
    "Start": "2024-02-09T10:00:00+00:00",
    "End": "2024-02-09T12:30:00+02:00",
    "Lessons Learned": "Participants will learn\r\n- How the Remote RobotFramework library can be used for fast prototyping and what limitations it has\r\n- On the importance of the ecosystem (such as VS Code plugins) for a good usability\r\n- Why turning to RobotFramework as an interface for custom test devices is a great choice",
    "Describe your intended audience": "Targeted for a broad audience: \r\n- Developers and testers that look for ideas how to use RobotFramework for test embedded hardware-related code\r\n- People familiar with RF to give feedback about the ideas/problems presented",
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "L977MQ",
    "Proposal title": "Working with Resources, Libraries and Variables: patterns and pitfalls",
    "Session type": {
      "en": "Tutorial"
    },
    "Track": null,
    "Abstract": "The Robot Framework offers many ways in which you can work with Resources, Libraries and Variables. This flexibility is a very powerful feature but as the saying goes: With great power comes great responsibility. And as always: Anything that can go wrong, will go wrong.",
    "Description": "In this tutorial I'll go over a number of patterns I've seen in Robot Framework projects, their pros and cons and related pitfalls.\r\n\r\n<br>\r\n\r\nWe'll also look at how a language server can help us (and how we can help the language server), what it's trying to tell us and how this relates to the tidy and robocop tools.\r\n\r\n<br>\r\n\r\nI hope to also show a proof-of-concept for a tool to visualize the import structure of a Robot Framework project that can help in improving the structure of a project.",
    "Duration": 120,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["EFQQP9"],
    "Speaker names": ["Robin Mackaij"],
    "Room": {
      "en": "RoboConOnline"
    },
    "Start": "2024-02-27T14:00:00+00:00",
    "End": "2024-02-27T18:00:00+02:00",
    "Lessons Learned": "- Better insight in how the Robot Framework resources / libraries system works\r\n- What (common) patterns there are and their pros and cons\r\n- How a language server / tidy / robocop can help solving \"import issues\" in a project",
    "Describe your intended audience": null,
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "LF8DXX",
    "Proposal title": "Maximizing Efficiency with RobotCode CLI Tools: A Comprehensive Guide",
    "Session type": {
      "en": "Tutorial"
    },
    "Track": null,
    "Abstract": "[RobotCode](https://robotcode.io/) is widely known as Visual Studio Code Extension, but it also provides a set of powerful command line tools that greatly enhance the development experience with Robot Framework. This tutorial will introduce the practical uses of these tools and show how they can streamline your workflow and improve project quality.",
    "Description": "Participants will learn how RobotCode CLI Tools can support their work in Robot Framework projects:\r\n\r\n- **Utilizing Configuration Files**: The `robot.toml` configuration file simplifies the definition of parameters necessary for executing tests and tasks, eliminating the need for complex command-line calls. It facilitates the creation of execution profiles for various environments, such as test, development, production, or CI.\r\n\r\n- **Efficient Querying of Project Information**: Developers can quickly identify which suites, tests, tasks, or tags are present in their project without the need for a complete test run or dry run. They can also experiment with different tag combinations and explore test cases associated with specific tags. This information can be easily displayed on the console and structured in a file for further processing.\r\n\r\n- **Enhancing Project Quality**: The RobotCode CLI Tools allow users to inspect their project for potential issues like typos, unknown keywords, imports, or variables. Furthermore, unused keywords or variables are detected, simplifying project-wide optimization. All diagnostic information displayed in the IDE is also available on the console.\r\n\r\n- **Optimizing Project Structure**: Developers can streamline their projects with RobotCode by removing unnecessary files or folders (i.e. the output folder). Additionally, they can generate new projects or files from pre-defined or custom templates.\r\n\r\nThis tutorial is for developers who want to optimize their use of Robot Framework with the advanced features of RobotCode. Participants should bring their own laptops, have a basic knowledge of Robot Framework and Python, and have a GitHub account. Installation is not required.",
    "Duration": 120,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["RMY3KA"],
    "Speaker names": ["Daniel Biehl"],
    "Room": {
      "en": "RoboConOnline"
    },
    "Start": "2024-02-27T11:00:00+00:00",
    "End": "2024-02-27T15:00:00+02:00",
    "Lessons Learned": "- How to create and use a `robot.toml` configuration file\r\n- How to use the `robotcode` command to execute tests and tasks, switching between different execution profiles, select profiles in VSCode, etc.\r\n- How to use the `robotcode` command to query project information\r\n- How to use the `robotcode` command to check project quality\r\n- How to clean up a project with the `robotcode` command\r\n- How to generate new projects or files from predefined templates with the `robotcode` command",
    "Describe your intended audience": null,
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "LHTGWU",
    "Proposal title": "Performance test in a day using Robot Framework and RFSwram",
    "Session type": {
      "en": "Workshop - Full Day"
    },
    "Track": null,
    "Abstract": "In this workshop you'll see how you can use Robot Framework and RFSwarm to begin performance testing on day 1 with a new to you application.\r\n\r\nStarting from scratch you will write test cases and tune them for performance testing and by end of the day run a performance test and then generate a report suitable for presenting your results.",
    "Description": "Attendees of this workshop will write some simple tests with robot framework, then make adjustments to those tests to prepare them for performance testing with RFSwarm, setup RFSwam components (Agent, Manager & Reporter), then run a performance test with RFSwam using the test cases created and prepare a test report from the performance test results and finally create a template of the report for future tests\r\n\r\n<br>\r\n\r\nIf time allows we'll cover monitoring of the AUT server, integration with CI/CD builds, Agents running in the cloud, and any questions that come up.\r\n\r\n<br>\r\n\r\nThe workshop will be based on a web store application to be representative of a typical application you might find in a retailer, The test steps to navigate the application as this would normally be provided to the test automation team.",
    "Duration": 420,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["UHHRL8"],
    "Speaker names": ["Dave Amies"],
    "Room": {
      "en": "Performance test in a day using Robot Framework and RFSwram"
    },
    "Start": "2024-02-06T07:00:00+00:00",
    "End": "2024-02-06T16:00:00+02:00",
    "Lessons Learned": "- How to tune a Robot Framework test case for optimal use with RFSwarm\r\n- How using RFSwarm can help an organization start performance testing quicker on their projects\r\n- How to use the various components of RFSwarm",
    "Describe your intended audience": "- People who currently use Robot Framework and are interesting in performance testing\r\n- People who currently use other performance testing tools and are interested in Robot Framework\r\n- People who currently use other performance testing tools and already use Robot Framework for other testing",
    "Is this suitable for ..?": "Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "LSJFXU",
    "Proposal title": "Harnessing the POWER of Robot Framework for Automation Of Data Quality Controls",
    "Session type": {
      "en": "PreRecorded-Talk"
    },
    "Track": null,
    "Abstract": "In this presentation we will go over a live use case showcasing the power of Robot Framework and it is usage in the Automation of Data Quality Controls.",
    "Description": "We live in a World of Data. We need data for almost every Analytical purpose. Financial institutions are one among the Major sectors using Data especially\r\nin Trade and investment, Tax reform, Fraud detection and Investigation and Risk Analysis.\r\n\r\nWe will have quick overview of a live use case and how we helped the client to tackle a real time problem by setting up an Automated Quality Controls process for Data Delivery to Analysis Teams.\r\n\r\nThe Client had a problem statement of running 2000+ Database queries across 180+ DB tables across different Delivery checkpoints. This was manual, much time consuming and prone to manual error.\r\n\r\nThe Data delivered to downstream systems was through different Business Layers, some in Hadoop, a few in Oracle and a few in files. I from Automation perspective saw the pattern of these queries and how we can simplify the whole process. I harnessed the power of Robot Framework and suggested to Automate the queries and we call it Data Quality Controls.\r\n\r\nWe used Robot Framework and Automated 2000+ Controls and this serves as entry and exit checkpoints at each Business level. These Data Quality Controls run every month to ensure accuracy, completeness, consistency, validity and no wrong data is supplied to the DownStream system.\r\n\r\nFramework Architecture:\r\nWe build a Hybrid Test Automation Framework with Page Object Model, combined with Keyword and Data Driven Architecture to cater our needs.\r\n\r\nTech Stack: Hadoop, HDFS, Oracle, Unix and Python\r\nTest Automation: Robot Framework with Python\r\n\r\nSavings:\r\nThe Quality Control Validations which were previous performed by Business Users for weeks to months, got reduced to less than a Day's effort. We saved over 5000+ Person Days over the years.\r\n\r\nOther Information:\r\nClient Details: \r\nThe client is one of the top Banks in Nordics. The Bank has its presence wide spread across Denmark, Sweden, Finland, Norway and Poland.\r\n\r\nProject Description:\r\nThe project is a regulatory compliance project for the Bank.\r\n\r\nAbout Me:\r\nI am an Automation Solution Architect and Automation Consultant with 12+Years of Experience, working for One of Top Global Tech Company- Tata Consultancy Services. I am from Chennai, India and I am currently in Sweden on Deputation.\r\n\r\nI have worked over a decade in Big Data Testing (Hadoop-Hive, Impala, HBase, HDFS) and Oracle DBs. \r\n\r\nAutomation and Frameworks:\r\nUI/API/DB/ETL Test Automation, Robot Framework Testing, Keyword/Data/Behaviour Driven Frameworks, POM Framework, TestNg and Hybrid framework\r\n\r\nRPA:\r\nUI Path- Advanced Developer Certified\r\n\r\nAutomation Tools:\r\nBackend- Robot Framework Testing, Fitnesse Test Automation Tool, Talend Data Integration and ETL Test automation using Excel Marco\r\n\r\nUI- Selenium Web Driver (Page Object Model and Hybrid Frameworks) and Selenium Grid\r\n\r\nAPI- SOAP UI and Rest Assured\r\n\r\nCICD- Jenkins\r\n\r\nLanguages known- C, C++, Java and Python\r\n\r\nMy LinkedIn Profile: https://www.linkedin.com/in/rohith-ram-prabakaran-28921180/",
    "Duration": 20,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["G3QVQY"],
    "Speaker names": ["Rohith Ram Prabakaran"],
    "Room": {
      "en": "RoboConOnline"
    },
    "Start": "2024-02-29T11:30:00+00:00",
    "End": "2024-02-29T13:50:00+02:00",
    "Lessons Learned": "- Customization of Robot Framework to serve different needs\r\n- Data Volume handling\r\n- Customizing SQL and validating Data correctness based SQL build using Python and Robot Framework\r\n- Integrating Robot Framework across CICD pipelines",
    "Describe your intended audience": "Data Warehouse Testing\r\nETL Testing",
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user"
  },
  {
    "ID": "LVMWVU",
    "Proposal title": "Why cybersecurity is part of your job as QA Engineer",
    "Session type": {
      "en": "PreRecorded-Talk"
    },
    "Track": null,
    "Abstract": "The average tester might feel that cybersecurity is something committed in a separate silo. In this talk I go through why cybersecurity is everybody's business and very much part of the QA. We cover the project security, testing security as part of the QA and how regression testing with Robot Framework can be part of security testing too.",
    "Description": "Cybersecurity is essential part of the software product quality. It is easy to think that it is some kind of niche and technical that only hackers understand. However you don't need to be Mr Robot looking for zero-day vulnerabilities. Many cybersecurity incidents are caused by flaws in the production quality that \"the normal QA\" could have spotted. \r\n\r\nThis talk covers what the average QA can do for:\r\n-Project security\r\n-Product security\r\n-Maintaining the security via regression testing",
    "Duration": 20,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["EVXAKM"],
    "Speaker names": ["Katarina Partti"],
    "Room": {
      "en": "RoboConOnline"
    },
    "Start": "2024-02-28T18:00:00+00:00",
    "End": "2024-02-28T20:20:00+02:00",
    "Lessons Learned": "In the talk I will go through some real-life breaches as examples and explain why the QA engineer is an essential part of the product security and how we can make an attitude shift in taking ownership in the security too and not just think \"it's someone elses problem\". I have some examples and discussion on the project and product security as well as giving food for thought on how the Robot Framework regression testing can also play a part in cybersecurity.\r\n\r\nAfter this session i hope the listener can evaluate their project's cybersecureness and knows practical best practices for test automation security. The participants should have new ideas and hopefully get the urge to know more about the subject and to do concrete actions in their work for better security.",
    "Describe your intended audience": "Testers, Automation Testers, anyone working with software.",
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "LVWRA8",
    "Proposal title": "Reinventing Test Automation at Amadeus: The Power of Robot Framework",
    "Session type": {
      "en": "PreRecorded-Talk"
    },
    "Track": null,
    "Abstract": "Amadeus develops solutions for the travel industry and must deal with different business and industry technology standards.\r\nThis presentation will highlight how Amadeus revolutionized its test automation framework by moving from various internal test tools to a single Robot Framework ecosystem with functional keywords libraries based on python.",
    "Description": "[Amadeus](www.amadeus.com) is the world leader in software solutions for the travel industry and must deal with a complex environment including many technologies, ranging from industry standard to very business-specific ones. This can include technologies like Angular UIs, REST APIs, Soap XMLs, Kafka but also more specific airlines protocols like [EDIFACT](https://unece.org/trade/uncefact/introducing-unedifact) or Cryptic commands.\r\nWith its Amadeus pioneer mindset culture many new tools were internally developed to create test scripts libraries which keep on growing with the time. Addressing and maintaining all these libraries became, over time, a real challenge.\r\nMoreover, building an end-to-end test solution with all these various tools turned out to be very complex and sometimes impossible, leading to a lot of manual test campaigns.\r\nIn this presentation we will show you how Robot Framework was a game changer for us as we started to automate in a much effective way, embracing the diversity of our technologies in a smooth way.\r\nWe will highlight:\r\n- how by designing python library templates, we now have a common way of developing our business specific keywords libraries providing guidelines without affecting flexibility and without forcing users to a strict model,\r\n- how our framework is based on standard keywords to send messages through the different protocols used for testing,\r\n- how the defined templates are easily adaptable to small and large products,\r\n- how we promote a standard model for the keyword documentation, and we centralize all the testing libraries documentation in one single place to ease the sharing,\r\n- and finally, how this model is compatible with our new Cloud Native Applications",
    "Duration": 20,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["QPFXQJ", "KVWYMA"],
    "Speaker names": ["Sebastien Plaisant", "Andrea Tipa"],
    "Room": {
      "en": "RoboConOnline"
    },
    "Start": "2024-02-29T15:30:00+00:00",
    "End": "2024-02-29T17:50:00+02:00",
    "Lessons Learned": "In this presentation we will highlight the key lessons we have learned from the project:\r\n•\tStandardization, speak a common language, is key but effort must be done in finding the right balance between providing the good flexibility without forcing the adoption of a strict model.\r\n•\tFunction approach is key to define your testing keywords. This approach is scalable and reflect product evolution (new features developed) as well as to be human understable.\r\n•\tSharing is another key pillar to promote existing testing keywords and avoid duplications.",
    "Describe your intended audience": null,
    "Is this suitable for ..?": "Intermediate RF user"
  },
  {
    "ID": "MEDT8A",
    "Proposal title": "Scalable test automation in an insurance company",
    "Session type": {
      "en": "PreRecorded-Talk"
    },
    "Track": null,
    "Abstract": "In our talk, we would like to review our project with you and visualise how we established a scalable test automation kit with Robot Framework in an insurance company with a heterogeneous application landscape. We report on the framework conditions, milestones and challenges to be considered.",
    "Description": "Provinzial Versicherung AG is the second largest public insurance group in Germany. We gain our strength from the regional ties of our subsidiaries. For more than 300 years, we have been where our customers are. Today, more than five million private and corporate customers place their trust in us.\r\nWith over 6,500 employees, almost 1,000 of whom work in IT, Provinzial Versicherung AG is also a major IT employer. \r\nThe application landscape is historically highly networked and complex. The entire software development process, starting with the creation of requirements and ending with the release of tests, is carried out decentrally in the respective teams. For this reason, various automation solutions have become established in our group.\r\nWe were commissioned about two years ago to unify the test automation process and develop a test automation strategy. Our journey began with the evaluation of various test tools and the comparison of different approaches to test automation. One of the challenges for a test automation solution was that software tests should be able to be automated by a wide range of users, even without development knowledge. In our talk we would like to review our project with you and visualise how we created a scalable test automation kit with Robot Framework. Among other things, we made the courageous decision for an insurance company to use an open source tool. Joining the Foundation should reflect our belief in the Framework and our commitment to it. In the meantime, Robot Framework is used for testing in over 20 applications.",
    "Duration": 20,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["99CJBK", "FPBMBN"],
    "Speaker names": ["Matthias Grabowsky", "Ivaylo Brüssow"],
    "Room": {
      "en": "RoboConOnline"
    },
    "Start": "2024-02-28T13:00:00+00:00",
    "End": "2024-02-28T15:20:00+02:00",
    "Lessons Learned": "In our talk, the audience will learn how Robot Framework was introduced as a central tool for test automation. We report on our identified opportunities and challenges, visualising a way to establish Robot Framework in a large corporation. In our test automation kit we have developed a comprehensive training and onboarding concept. In addition to using many available libraries, we develop internal libraries in a central team, which are used in the decentralised development teams. \r\nOur talk shows the audience our path and our success story in introducing test automation. We want to show others that the use of Robot Framework is a good decision and want to give inspiration about the successes we have had in a short time.",
    "Describe your intended audience": null,
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user"
  },
  {
    "ID": "P8PLF7",
    "Proposal title": "RoboSAPiens: SAP GUI Automation for Humans",
    "Session type": {
      "en": "Talk"
    },
    "Track": null,
    "Abstract": "RoboSAPiens provides keywords for automating the SAP Windows GUI in a way that resembles commanding a person to use it. The key innovation is that only information visible in the user interface is needed. Moreover, it is designed to be translatable. Currently, keywords are available in English and German.",
    "Description": "The SAP Windows GUI client is widely used around the world and across many industries. Its users are mostly domain experts, who are increasingly interested in automating business processes for quality assurance purposes. And they want do it using the language of the domain instead of a programming language.\r\n\r\nRoboSAPiens provides a set of keywords for automating the SAP Windows GUI in a way that resembles commanding a person to use it. The key innovation is that only information visible in the user interface is needed. This is in stark contrast to existing solutions, which rely on the low-level structure of the GUI, resulting in cryptic automation scripts. In order to empower domain experts around the world, RoboSAPiens is designed to be translatable. Currently, keywords are available in English and German.\r\n\r\nThis talk provides a short tutorial to get started using RoboSAPiens. After the installation and setup, different keywords will be showcased in a live demo. Along the way tips and tricks for automating the SAP GUI will be shared. There will also be some anecdotes from RoboSAPiens in the wild.\r\n\r\nRoboSAPiens was initially developed by imbus as an internal project at NRW.Bank (the state development bank of the federal state of North Rhein-Westphalia in Germany). Due to its positive impact on the efficiency of quality assurance tasks, the bank decided to make it available to the world as open-source software. imbus continues the development of RoboSAPiens. The source code can be found at [https://github.com/imbus/robotframework-robosapiens](https://github.com/imbus/robotframework-robosapiens).",
    "Duration": 30,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["R978PJ"],
    "Speaker names": ["Marduk Bolaños"],
    "Room": {
      "en": "RoboCon"
    },
    "Start": "2024-02-08T12:40:00+00:00",
    "End": "2024-02-08T15:10:00+02:00",
    "Lessons Learned": "Since this is a new tool and it is aimed at domain experts, this talk will serve as an introduction and short tutorial. Participants can expect to learn the following:\r\n\r\n- Which keywords are available\r\n- How to use RoboSAPiens interactively\r\n- Pro tips for getting the most out of RoboSAPiens",
    "Describe your intended audience": "The intended audience of the talk are people who work with the SAP Windows GUI and would like to automate it to save time. This includes automatically filling out forms with data from Excel and automating manual tests.",
    "Is this suitable for ..?": "Beginner RF user"
  },
  {
    "ID": "PQUXLU",
    "Proposal title": "Creating a Web Testing Framework from scratch using Robot Framework and Browser Library",
    "Session type": {
      "en": "Tutorial"
    },
    "Track": null,
    "Abstract": "Starting a new web project? Need to automate manual web tests? Want to automate some other browser based processes? This tutorial will help You set up Your web testing framework from scratch, the right way!",
    "Description": "**Creating a Web Testing Framework using Robot Framework and Browser Library from Scratch**\r\n\r\n1. **Initial Setup** - 10 minutes\r\n   - In this step, we will set up the environment for our web testing framework. We will install the necessary software and libraries, and configure the system to run our tests.\r\n\r\n2. **Basic Web Test Case** - 20 minutes\r\n   - In this step, we will create a basic web test case using Robot Framework and Browser Library. We will learn how to open a browser, navigate to a website, and perform some basic actions.\r\n\r\n3. **Introduce Page Object Pattern** - 20 minutes\r\n   - In this step, we will introduce the Page Object Pattern, which is a design pattern used in web testing to make tests more maintainable and easier to read. We will learn how to create page objects and use them in our tests.\r\n\r\n4. **Move Locators to Variable Files** - 10 minutes\r\n   - In this step, we will move the locators used in our tests to variable files. This makes it easier to maintain our tests as we can change the locators in one place instead of having to update them in multiple places. This also allows easier reuse in multiple locations\r\n\r\n5. **Handle File Upload and Download** - 20 minutes\r\n   - In this step, we will learn how to handle file upload and download using Robot Framework and Browser Library. We will learn how to upload a file to a website and download a file from a website.\r\n\r\n6. **Handling iFrames and Shadow Dom** - 20 minutes\r\n   - In this step, we will learn how to handle iFrames and Shadow DOM using Robot Framework and Browser Library. We will learn how to switch between iFrames, interact with elements inside iFrames, and interact with elements inside Shadow DOM.\r\n\r\n7. **Remote Execution using LambdaTest** - 20 minutes\r\n   - In this step, we will learn how to execute our tests remotely using LambdaTest. We will learn how to configure our system for remote execution and run the tests on LambdaTest.",
    "Duration": 120,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["QBMFY7"],
    "Speaker names": ["Jerzy Głowacki"],
    "Room": {
      "en": "RoboConOnline"
    },
    "Start": "2024-03-01T09:00:00+00:00",
    "End": "2024-03-01T13:00:00+02:00",
    "Lessons Learned": "This was pretty much covered in the talk description, but it's as follows:\r\n1. Initial Environment Setup for Web Testing with Browser Library\r\n2. Creating Basic Web Test Cases using Browser Library\r\n3. Using Page Object Pattern in Web Tests\r\n4. Using Variable Files for Locators\r\n5. Handling File Upload and Download\r\n6. Handling iFrames and Shadow Dom\r\n7. Remote Execution using LambdaTest",
    "Describe your intended audience": "This tutorial is directed mostly at people who are interested in creating their first web testing framework or enhancing their existing one.\r\n\r\n<br>\r\n\r\nBasic Robot Framework knowledge will be required, but everything else should be covered within the tutorial. Also a non-corporate PC is advised as many company firewalls block npm repositories",
    "Is this suitable for ..?": "Beginner RF user"
  },
  {
    "ID": "QKEUZP",
    "Proposal title": "Robot Framework Browser Advanced Workshop",
    "Session type": {
      "en": "Workshop - Full Day"
    },
    "Track": null,
    "Abstract": "Learn how to use Browser like a Pro.\r\n\r\nExtending Library, Using it from Python, Interacting with Playwright and many more.",
    "Description": "**Description**:\r\nDive deep into the world of web automation with Tatu and René using the Browser library for Robot Framework. This state-of-the-art library, powered by Playwright, is designed for the modern web, ensuring speed, reliability, and visibility. In this workshop, participants will not only learn the basics of JavaScript but also how to extend the Browser library by creating custom keywords in both JavaScript and Python. We’ll also cover the advanced features and keywords of the Browser library, ensuring a comprehensive understanding of web automation.\r\n\r\n**Agenda**:\r\n- 1. **Browser Fundamentals**\r\n   - 1.1 Installation and binary structure (Tatu)\r\n   - 1.2 Importing Settings (René)\r\n   - 1.3 Logging (playwright Logs, Robot Loglevel, PW Trace) (Tatu)\r\n   - 1.4 Browser, Context, Page (Catalog, Switching) (Tatu)\r\n   - 1.5 Basic JS (René)\r\n- 2. **Extending Browser**\r\n   - 2.1 JavaScript Plugin-API (René)\r\n   - 2.2 Python Plugin-API (Tatu & René)\r\n   - 2.3 AssertionEngine (Tatu)\r\n   - 2.4 Using Browser from Python (René)\r\n- 3. **Browser Advanced Keywords**\r\n   - 3.1 Waiting (Tatu)\r\n   - 3.2 Promise To (René)\r\n   - 3.3 Get Element States (René)\r\n   - 3.4 Upload File (Selector or Dialog) (René)\r\n   - 3.5 Selectors (CSS, nth, playwright possibilities) (René)",
    "Duration": 420,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["8HSX9A", "HTDUSJ"],
    "Speaker names": ["Tatu Aalto", "René Rohner"],
    "Room": {
      "en": "Robot Framework Browser Advanced Workshop"
    },
    "Start": "2024-02-06T07:00:00+00:00",
    "End": "2024-02-06T16:00:00+02:00",
    "Lessons Learned": "**Key Takeaways**:\r\n- Understand the capabilities of the Browser library and its integration with Playwright.\r\n- Learn to write custom keywords in JavaScript and Python to extend the Browser library.\r\n- Deep dive into advanced keywords and features of the Browser library.\r\n- Gain hands-on experience with real-world web automation scenarios.",
    "Describe your intended audience": "**Knowledge Level**:\r\n- **Robot Framework**: Advanced knowledge and experience required.\r\n- **Browser or SeleniumLibrary**: Familiarity with Browser Library or extensive experience with SeleniumLibrary.\r\n- **Web Testing**: Experience in web automation and a basic understanding of HTML.\r\n- **Python**: Basic proficiency.\r\n\r\n**Preparation and Tech Requirements**:\r\n- **Computer**: Capable of running Robot Framework and Browser library with internet access.\r\n- **Software**:\r\n  - Python >= 3.8\r\n  - NodeJS 18 or 20\r\n  - Robot Framework >= 6.1\r\n  - Robot Framework Browser >= 18\r\n  - Editor (IDE) for Python and JavaScript (e.g., VSCode)\r\n  - Optional: Robot Framework language support (Recommended: Robot Code plugin for VSCode)\r\n  - Note: For those unable to install software, GitPod, a cloud-based browser IDE, is an alternative.\r\n- **Accounts**: A GitHub account.\r\n- **Test Case**: We will provide a test case to verify your setup.",
    "Is this suitable for ..?": "Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "QQSGJU",
    "Proposal title": "Roadtrip across the Robot Framework pitfalls and how our architecture saved us.",
    "Session type": {
      "en": "Talk"
    },
    "Track": null,
    "Abstract": "Ever had to restructure your project because it grew into an untameable monster? Or had to reorganise because more teams wanted to use your project? Or had to explain your tests to others? Or struggled how to setup a new RF project.\r\nOver the years we came up and fine-tuned an architecture that works from the very beginning to large scale projects.",
    "Description": "We will take you along the ride during the course of seven years where we implemented Robot Framework in different environments at different clients. During this period, we ran into many challenges of which we are sure most of the attendees have already ran, or will run into sooner or later. \r\n\r\nOur journey started when our team responsible for test management in a large organisation decided Robot framework was the tool to help them to implement test automation within the organisation.\r\n\r\nAs so often in this situation, we started with one team that needed testcases for a web application. But, after a few months of success, problems start to occur with re-using parts of the scripts, maintainability and of course, the ever-expending universe of applications to test and the platforms they work on. Our solution? An architecture that puts keywords in segregated resource-files which is backed-up by straight forward and easy to apply rules that prevents ambiguous keywords and increases maintainability. \r\n\r\nBut a good architecture doesn’t stop there. As our journey continuous, stakeholders want to get a grip on what is tested. The organization wants to use the framework across all the teams and use it for end-to-end testing of the most critical processes. Just a good technical architecture doesn’t cut it here. Aggregation is needed and we needed to enhance the readability of the testscripts even further in order to enable collaboration between development teams and their stakeholders. We will tell you which additions to our architecture we came up with to answer these questions.\r\n\r\nOf course, as in every modern environment where software is created, pipelines and code repositories are supported and facilitated by the architecture, and we will briefly take a look at this as well.\r\n\r\nSince the first design of our architecture, we’ve used this as a basis for several clients. As every environment comes with its own challenges, we found the basis of the architecture very reliable and with some tweaking here and there it never seems to let us down. So, join us for the ride and see if we can inspire you to face your own challenges with our architecture.",
    "Duration": 30,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["HL7EQT", "NEBFDV"],
    "Speaker names": ["Guido Demmenie", "Frank van der Kuur"],
    "Room": {
      "en": "RoboCon"
    },
    "Start": "2024-02-08T15:00:00+00:00",
    "End": "2024-02-08T17:30:00+02:00",
    "Lessons Learned": "At the end of the talk, attendees will have seen a proven best practice architecture on how to structure resources in such a way that they can:\r\n- easily maintain their project\r\n- easily collaborate with stakeholders in creating and communicating tests\r\n- easily collaborate across teams and projects within a larger organisation\r\n\r\nWe will show our solutions to common challenges that you will face when setting up the robot framework in a new environment and when scaling up to multiple applications and/or teams.",
    "Describe your intended audience": "Since it is an architecture that is useful on small scale to large scale projects, everyone can benefit from the good practices we used.",
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "QYL83X",
    "Proposal title": "From Jenkins to GitHub Actions with Robot Framework: A Shared Action-Based Solution",
    "Session type": {
      "en": "PreRecorded-Talk"
    },
    "Track": null,
    "Abstract": "Let's explore the possibilities of migrating the Robot Framework execution environment from Jenkins to GitHub Actions.\r\nOur solution leverages actions, all sharable within our company, for setup, test execution, result analysis (with proper formatting within GitHub Job Summary), as well as result propagation into our test management tool Jira.",
    "Description": "We are faced with the challenge of leaving the familiar Bitbucket environment for our repositories and Jenkins for test execution in favor of cloud solution from GitHub with GitHub Actions.\r\nOur goal is to introduce to you our concept, thanks to which we can gradually move individual projects - individual repositories to GitHub and use the launch of tests directly within the repository using GitHub Actions.\r\nAs runners, we use our own Linux images running in the OpenShift 4 platform. At this moment, we benefit from GitHub caching capabilities for quick install and setup of current environment for testing. \r\nWe created separate Actions that we share within the organization and that provide us with the necessary steps:\r\n\t•  **Preparation of the environment**, including Python installation, setting up Robot Framework, Browser Library, and making necessary tweaks such as proxy settings.\r\n\t•  **Test Execution** through a shared action, saving results to an artifact, and displaying an extract in the GitHub Job Summary.\r\n\t•  **Importing results to Jira** This action ensures the results are written using Xray for our reporting tool.\r\n\r\nDuring this talk, we will be happy to show you what challenges and technological limitations we faced, how we solved them and how we use this new approach in our company on day-to-day basis. \r\nWe're hopeful that our experience can inspire other teams facing similar scenarios.",
    "Duration": 20,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["LQRAAR"],
    "Speaker names": ["Roman Haladej"],
    "Room": {
      "en": "RoboConOnline"
    },
    "Start": "2024-02-29T12:00:00+00:00",
    "End": "2024-02-29T14:20:00+02:00",
    "Lessons Learned": "The talk highlights the challenge of transitioning from on-premises solutions like Jenkins and Bitbucket to a cloud-based solution like GitHub Actions.\r\nThe lesson learned here is that organizations need to adapt to changing technologies and consider cloud solutions for more flexibility and scalability. As well as creation of separate actions for various testing steps, such as environment preparation, test execution, and result import into Jira. This approach allows for better organization and reuse of actions.\r\nMain approach is to break down complex processes into manageable steps, making them more maintainable and shareable.\r\nPart of this solution is displaying an extract directly in the GitHub Job Summary and Integrating test results into Jira, specifically using Xray for reporting.",
    "Describe your intended audience": "Developers or DevOps teams interested in transitioning from Bitbucket and Jenkins to GitHub and GitHub Actions.\r\nThose who are keen on improving their automation skillsets, especially with regards to testing.\r\nTech teams grappling with similar technological constraints, who could benefit from discovering our problem-solving approaches.\r\nAnd anyone excited to learn about practical usage of Git Hub Actions and GitHub Job Summary with Robot Framework.",
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user"
  },
  {
    "ID": "RF3RYU",
    "Proposal title": "Robot Framework Unleashed: Let's automate EVERYTHING",
    "Session type": {
      "en": "Workshop - Full Day"
    },
    "Track": null,
    "Abstract": "Being an Automation Engineer often means that you need to steer different applications and technologies.  \r\n- Web Apps\r\n- APIs & Webservices\r\n- Desktop Apps\r\n- Databases\r\n- Mobile Apps, ..  \r\n\r\nLet me show you a list of selected libraries which will help you to achieve that and try them out with real examples.\r\nLet's automate some stuff together!",
    "Description": "What to expect:  \r\n- Proper Environment setup, using VS Code & RobotCode, Virtual Environments\r\n- Web Application Testing using Browser Library and Selenium Library\r\n- API Testing using Requests Library, RESTinstance and SoapLibrary\r\n- Mobile Testing using AppiumLibrary\r\n- ImageBased Automation using ImageHorizonLibrary\r\n- Desktop Application Testing using rpaframework, FlaUI and RemoteSwingLibrary\r\n- ?",
    "Duration": 420,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["T7BUER"],
    "Speaker names": ["Many Kasiriha"],
    "Room": {
      "en": "Robot Framework Unleashed: Let's automate EVERYTHING"
    },
    "Start": "2024-02-06T07:00:00+00:00",
    "End": "2024-02-06T16:00:00+02:00",
    "Lessons Learned": "-Learn about different Robot Framework Libraries which can be used to automate different Technologies.\r\n-Making decision about the right library for your project.\r\n-Having a good structure of automation project.\r\n-Have fun automating stuff",
    "Describe your intended audience": "People who know the Robot Framework Basics and that are hungry to automate some applications.",
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user"
  },
  {
    "ID": "RKDPWC",
    "Proposal title": "How not to write ugly Robot Framework code",
    "Session type": {
      "en": "Tutorial"
    },
    "Track": null,
    "Abstract": "How to organize your Robot Framework project? How to structure your test code in resource files? How to deal with very long lines? How to ...? Join this tutorial to learn where to find answers on these questions. We will also share a little secret how to become a contributor to the first Style Guide for Robot Framework.",
    "Description": "Below is a preliminary outline of the Tutorial. Please note that it might be modified by the time Tutorial is held. This is in an effort to make the 2 hours as fruitful as possible.\r\n\r\n<br>\r\n\r\nTutorial will start with a general introduction, followed by a warm-up discussion in groups about the code quality, specifically, in the context of Robot Framework (~5+15 minutes minutes).\r\n\r\n<br>\r\n\r\nNext, tools and resources to assist code writing will be introduced: Style Guide, robocop, robotidy (~30 minutes)\r\n\r\n<br>\r\n\r\nOptional break (10 minutes)\r\n\r\n<br>\r\n\r\nAfter the break, guided hands-on sessions will be held. The first hands-on session will include an exercise to convert a messy Robot Framework code into a clean code with the help of the Style Guide, robocop and robotidy.\r\n(25 minutes)\r\n\r\n<br>\r\n\r\nReflection - opinions regarding the recommendations in the Style Guide, and default rules in the robocop/robotidy.\r\n(10 minutes)\r\n\r\n<br>\r\n\r\nThe last part of the tutorial will be dedicated to coming up with own conventions:\r\n- Configuring settings in robocop and robotidy (demo ~10 minutes)\r\n- Contributing to common Style Guide and using it as a common reference (~10 minutes).\r\n\r\n<br>\r\n\r\nConclusion (~5 minutes)\r\n\r\n<br>\r\n\r\nEveryone is welcome, from beginners to experts. We recommend participants to bring their own laptops for hands-on exercises but laptops are not mandatory for attending the tutorial.",
    "Duration": 120,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["9BRJUX", "HL7EQT", "WG3A8G"],
    "Speaker names": ["Kelby Stine", "Guido Demmenie", "Manana Koberidze"],
    "Room": {
      "en": "RoboConOnline"
    },
    "Start": "2024-03-01T13:30:00+00:00",
    "End": "2024-03-01T17:30:00+02:00",
    "Lessons Learned": "Participants will learn how not to write an ugly Robot Framework code. \r\n\r\n<br>\r\n\r\nThey will learn how well-written test code looks like, and what resources and tools they can use to help them write a clean Robot Framework code. Participants will also learn how they can contribute to defining the coding standard for Robot Framework.\r\n\r\n<br>\r\n\r\nFor more detailed outline of the proposed Tutorial, please refer to the \"Description\" filed in this application.",
    "Describe your intended audience": "Anyone interested is welcome to the Tutorial.",
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "RNDZQB",
    "Proposal title": "Empowering Lives Through Automation: A Success Story of the Testing Academy",
    "Session type": {
      "en": "PreRecorded-Talk"
    },
    "Track": null,
    "Abstract": "Discover how a Testing Academy mixed with Robot Framework changes peoples lives, empowering individuals to dream bigger, and succeed beyond their wildest expectations. The Robot Framework, in this talk where we will present the real testimonies of people, is no longer an automation tool but the tool that enables career transition.",
    "Description": "In an ever-evolving world driven by fast technological advancements like AI, the power of test case automation to influence better software delivered in production has become undeniable. \"Empowering Lives Through Automation: A Success Story of the Testing Academy \" delves into an inspiring narrative that explores how a Testing Academy mixed with Robot Framework is open door to the career transition and changed the lives of individuals.\r\n\r\nThis captivating journey begins with an introduction to Testing purpose and ends with the basics to automate front ends with total independence. The story unfolds as we follow a group of diverse individuals, each with their unique backgrounds, aspirations, challenges, mainly women, who left their country (Brazil) in search of a future in Europe, and still haven't found their place. So, they share a common thread—a burning desire to embrace a career transition and reshape their destinies.\r\n\r\nThe narrative provides an in-depth look into the rigorous training and mentorship these students receive, underlining the academy's commitment to ensuring their success. As they immerse themselves in the world of testing and automation testing, they discover new skills, develop innovative mindsets, and experience personal growth. \r\n\r\nIn the field of Test Automation, the Robot Framework is the right tool for a this kind of academy. The Keyword driven mode, being an almost natural language, makes everything very easy. Is amazing how these individuals get new confidence in their lives and purpose.\r\n\r\nThe talk also touches on the broader societal implications of this success story. By positively transforming the lives of those arriving from another country, where unemployment, low wages and street violence exist, we demonstrate that we contributing to the millennium goals (according to the UN)\r\n\r\nIn conclusion, \"Empowering Lives Through Automation: A Success Story of the Testing Academy\" is a compelling exploration of the profound, often emotional, impact that testing academy mixed with test case automation provided by Robot Framework can have on individuals and their communities. This talk serves as a testament to the endless possibilities presented by Robot Framework tool, it's not just an automation tool, but a tool to change people's lives.",
    "Duration": 20,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["RHSU38"],
    "Speaker names": ["Paulo José Estrela Vitoriano de Matos"],
    "Room": {
      "en": "RoboConOnline"
    },
    "Start": "2024-02-28T11:30:00+00:00",
    "End": "2024-02-28T13:50:00+02:00",
    "Lessons Learned": "1) Robot Framework  is \"the\" tool to include in any QA academy program. Attendees will have access to the course program.\r\n\r\n1.1) The fact that we know that Robot Framework is Open Source gives us the certainty that educational programs using this tool have a future\r\n\r\n2) The easy-to-read Keyword driven functionality is a huge asset, like the RF foundation say \"human-readable keywords. \". This asset need to be real valued for all participants in the development cycle, whether QAs, BAs or DEVs. It will be clear to everyone that keywords from libraries are the method they should use by default\r\n\r\n3) in a labor market with a lack of automation resources, transforming manual testers into testers is possible with a RF and a short learning curve, or, being more radical (as in this story case demonstrates), total professional retraining.",
    "Describe your intended audience": "The main audience for this talk is management teams or team leaders. Management teams are currently struggling to start automating (and they needed), essentially due to a lack of human resources. This is one solution. \r\n\r\nSecondly, manual testers can use these user story example to feel the boost to make the leap to automation.",
    "Is this suitable for ..?": "Beginner RF user"
  },
  {
    "ID": "RYES8M",
    "Proposal title": "Mystery Challenge: The Robot Framework Edition",
    "Session type": {
      "de": "Keynote",
      "en": "Keynote"
    },
    "Track": null,
    "Abstract": "Welcome, everyone! Today's conference session is set to be a unique and thrilling experience, blending technology with an element of fun. We've prepared an interactive segment that's more than just a discussion – it’s a challenge of wit and quick thinking, centered around the intriguing world of the Robot Framework.",
    "Description": "Welcome, everyone! Today's conference session is set to be a unique and thrilling experience, blending technology with an element of fun. We've prepared an interactive segment that's more than just a discussion – it’s a challenge of wit and quick thinking, centered around the intriguing world of the Robot Framework.\r\n\r\nGet ready for an engaging adventure that tests your knowledge in unexpected ways. We promise a mix of surprise, competition, and learning, all wrapped in a game-like format.\r\n\r\nThe details are a mystery for now, but the excitement is just moments away. Prepare for a session that's as entertaining as it is enlightening.",
    "Duration": 60,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["HTDUSJ"],
    "Speaker names": ["René Rohner"],
    "Room": {
      "en": "RoboCon"
    },
    "Start": "2024-02-08T15:30:00+00:00",
    "End": "2024-02-08T18:30:00+02:00",
    "Lessons Learned": "Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.",
    "Describe your intended audience": null,
    "Is this suitable for ..?": "Advanced RF user"
  },
  {
    "ID": "SCRLQS",
    "Proposal title": "Lighting Talks",
    "Session type": {
      "en": "Talk"
    },
    "Track": null,
    "Abstract": "Spontaneous Proposals: Attendees are encouraged to pitch their talk ideas during the conference. Be ready to share your insights!\r\nAudience-Powered: The audience votes to select the most captivating talks in the conference APP.\r\nDynamic Presentations: Selected talks will be featured in this fast-paced, exciting slot. Each speaker gets a 7 minutes.",
    "Description": "Spontaneous Proposals: Attendees are encouraged to pitch their talk ideas during the conference. Be ready to share your insights!\r\nAudience-Powered: The audience votes to select the most captivating talks in the conference APP.\r\nDynamic Presentations: Selected talks will be featured in this fast-paced, exciting slot. Each speaker gets a 7 minute time limit to present their ideas concisely and engagingly.\r\n\r\nJoin us for a whirlwind of fresh perspectives and innovative ideas, all chosen by you!",
    "Duration": 30,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": [],
    "Speaker names": [],
    "Room": {
      "en": "RoboCon"
    },
    "Start": "2024-02-09T12:30:00+00:00",
    "End": "2024-02-09T15:00:00+02:00",
    "Lessons Learned": "Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.",
    "Describe your intended audience": "Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.",
    "Is this suitable for ..?": "Advanced RF user"
  },
  {
    "ID": "SRW9V8",
    "Proposal title": "Beyond log files: Elevating test analysis with data visualization",
    "Session type": {
      "en": "Talk"
    },
    "Track": null,
    "Abstract": "Discover the limitations of raw data and learn why visualizations are essential for making informed decisions. Harness the art of visualization to decode data intricacies.",
    "Description": "The Robot Framework output files give a good overview of the latest run. For short term analysis, that is sufficient, but you will not know if passes, failures, execution times, etc. are consistent, unexpected, or following a certain trend. Therefore, data visualization is the key to unlock the potential of all the collected data and deep data analysis. They help your team react to issues faster and in some cases they even help you understand possible issues even before they become actual issues enabling proactive actions.\r\n\r\nThis presentation will explore some real life examples from telecom and embedded systems industries where data visualization helped organizations evaluate their systems from a different perspective, so they could identify and justify necessary actions to help them get back on track. The talk will expand the knowledge of available data and give tips on how to harness that data into use to reveal your unknown issues, gain confidence in your systems, and improve your testing overall.",
    "Duration": 30,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["RSWYRV"],
    "Speaker names": ["Aleksi Simell"],
    "Room": {
      "en": "RoboCon"
    },
    "Start": "2024-02-08T13:40:00+00:00",
    "End": "2024-02-08T16:10:00+02:00",
    "Lessons Learned": "Listeners will learn the possibilities of digging up data from the output.xml themselves and learn about different tools for data storage (different databases, e.g InfluxDB), visualizations (mainly Grafana), and give possible new ideas on what they can start visualising in their own projects.",
    "Describe your intended audience": "Target audience is everyone who works with Robot Framework and hopefully in a CI/CD environment. The talk won't be very technical, but the actual practices will be for more technical oriented people (the ones who actually do the data collection).",
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "SSECGZ",
    "Proposal title": "The Pros and Cons of Generative AI in Robot Framework",
    "Session type": {
      "en": "Talk"
    },
    "Track": null,
    "Abstract": "Explore the fusion of Generative AI with Robot Framework, spotlighting enhancements and hurdles in test automation. Discover how can AI elevate our testing while addressing its limitations. Engage in a balanced discourse to navigate AI's realm in QA, fostering a smarter, informed approach to AI-integrated testing.",
    "Description": "In the rapidly evolving domain of Generative AI, models like ChatGPT are emerging as potent tools, sparking curiosity about their test automation application. This presentation endeavors to provide a balanced exploration of integrating Generative AI with Robot Framework, spotlighting both the promising avenues and the cautionary tales.\r\n\r\nDiscussion points:\r\n\r\n1. **Test Data Generation**:\r\n   - Illustrate how Generative AI can automate the creation of diverse test data while highlighting the risks of over-reliance on AI-generated data that might overlook critical real-world scenarios.\r\n\r\n\r\n2. **Edge Case Identification**:\r\n   - Explore AI's potential in uncovering obscure edge cases, juxtaposed with its limitation in understanding the contextual relevance of these cases.\r\n\r\n\r\n3. **Dynamic XPath Generation with AI**:\r\n   - Delve into AI's capability in generating adaptive XPaths, and discuss scenarios where AI-generated XPaths might not be reliable or efficient.\r\n\r\n\r\n4. **AI Integration via Listeners API**:\r\n   - Showcase the ease of integrating AI with Robot Framework, while also addressing the potential complexities and troubleshooting challenges this integration might introduce.\r\n\r\n\r\n5. **API Test Scenarios Generation**:\r\n   - Discover how Generative AI can aid in formulating comprehensive and robust API test scenarios, simplifying the QA process for API testing.\r\n\r\n\r\n6. **Automating SQL Test Cases**:\r\n   - Uncover the potential of Generative AI in writing SQL automation tests, enhancing the efficiency and accuracy of database testing.\r\n\r\nAttendees will traverse through real-world scenarios, gaining a nuanced understanding of the opportunities and challenges at the crossroads of Generative AI and Robot Framework. The talk aims to equip attendees with a well-rounded perspective, inspiring informed experimentation with AI in their test automation endeavors, while shedding light on the practicality and limitations of AI in test automation.",
    "Duration": 30,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["8U3B3T"],
    "Speaker names": ["David Fogl"],
    "Room": {
      "en": "RoboCon"
    },
    "Start": "2024-02-08T08:25:00+00:00",
    "End": "2024-02-08T10:55:00+02:00",
    "Lessons Learned": "This talk aims to provide a comprehensive exploration of integrating Generative AI with Robot Framework in test automation, shedding light on the potential enhancements, practical applications, and challenges that may arise. Here’s a detailed breakdown of the learning outcomes and practical takeaways for the attendees:\r\n\r\n1. Understanding Generative AI in QA Context:\r\n   - A clear exposition of what Generative AI is, and its application in Quality Assurance and test automation.\r\n   \r\n2. Automated Test Data Generation:\r\n   - Insights into harnessing Generative AI for generating a diverse range of test data, saving time, and ensuring broader test coverage.\r\n   - Discussing the risks associated with relying solely on AI-generated data and strategies to mitigate these risks.\r\n\r\n3. Edge Case Identification:\r\n   - Exploration of AI's capability in identifying edge cases and enhancing testing robustness.\r\n   - Discuss AI's limitations in understanding edge cases' contextual relevance, and strategies to address this.\r\n\r\n4. Dynamic XPath Generation:\r\n   - Delving into the efficiency brought about by AI in generating dynamic XPaths and scenarios where it might not be as effective.\r\n\r\n5. Seamless AI Integration:\r\n   - Showcasing the development process of integrating Generative AI with Robot Framework using the Listeners API and providing some practical outcomes of this integration, enabling attendees to grasp the practical benefits and possible hurdles.\r\n\r\n6. API Test Scenarios Generation:\r\n   - Practical insights into leveraging AI for creating robust API test scenarios, making the QA process for API testing more streamlined.\r\n\r\n7. Automating SQL Test Cases:\r\n   - Exploring the potential of AI in automating SQL test cases, and how it can improve efficiency and accuracy in database testing.\r\n\r\n8. Real-world Applications and Challenges:\r\n   - Real-world examples demonstrating the application of Generative AI in test automation.\r\n\r\nBy the end of this talk, participants will have a well-rounded understanding of the potential and limitations of Generative AI in test automation within Robot Framework. They’ll be equipped with practical knowledge and insights to apply in their teams and projects, fostering informed experimentation and pragmatic innovation in AI-powered test automation.",
    "Describe your intended audience": "The talk is intended for a broad audience of robot framework users.",
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "TQTQQN",
    "Proposal title": "Opening the Conference",
    "Session type": {
      "de": "Keynote",
      "en": "Keynote"
    },
    "Track": null,
    "Abstract": "Welcome to RoboCon! In this session, we will provide an overview to set the tone and outline what attendees can expect from the conference. \r\n\r\nThe session will",
    "Description": "Welcome to RoboCon! In this session, we will provide an overview to set the tone and outline what attendees can expect from the conference. \r\n\r\nWe will have a quick run-through of our program, highlighting a range of topics from Libraries to QA.\r\n\r\nWe will also explain the practicalities, and Mateusz will talk about engagement and gamification.\r\n\r\nRené and Miikka will introduce the RoboCon Foundation and the latest news on that front. \r\n\r\nThe session will conclude with a handover to Pekka for Robot Framework 7.0 news.",
    "Duration": 60,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["VWRTSC", "HTDUSJ", "FQJRHW", "D3ZLT3"],
    "Speaker names": [
      "Mateusz Nojek",
      "René Rohner",
      "Miikka Solmela",
      "Pekka Klärck"
    ],
    "Room": {
      "en": "RoboCon"
    },
    "Start": "2024-02-08T07:00:00+00:00",
    "End": "2024-02-08T09:40:00+02:00",
    "Lessons Learned": "Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.",
    "Describe your intended audience": null,
    "Is this suitable for ..?": "Advanced RF user"
  },
  {
    "ID": "TRRAEX",
    "Proposal title": "SeleniumLibrary: 2024 and Beyond",
    "Session type": {
      "en": "PreRecorded-Talk"
    },
    "Track": null,
    "Abstract": "An update on where SeleniumLibrary in 2024, Selenium 4 and the future developments like WebDriver Bidi",
    "Description": "We will go through the latest updates of where SeleniumLibrary is and some upcoming features of Selenium like selenium-manager and WebDriver BiDirectional (Bidi) Protocol. We will cover some Selenium 4 functionality as well.",
    "Duration": 20,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["JDRR8S", "GZRASZ"],
    "Speaker names": ["Ed Manlove", "Yuri Verweij"],
    "Room": {
      "en": "RoboConOnline"
    },
    "Start": "2024-02-28T18:30:00+00:00",
    "End": "2024-02-28T20:50:00+02:00",
    "Lessons Learned": "Learn about features that might not be aware of and highlight others that are useful",
    "Describe your intended audience": "Anyone doing web testing and Robot Framework",
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "TYXDEF",
    "Proposal title": "Mobile application testing with Robot Framework",
    "Session type": {
      "en": "Workshop - Full Day"
    },
    "Track": null,
    "Abstract": "Testing mobile applications is similar to web testing. Many apps are just mini-websites. However, on a technical level, there are differences, due to mobile devices, and their complex ecosystems. This workshop is a hands-on technical session to mobile testing with RF and Appium. Learn how to approach mobile testing, or improve your existing tests.",
    "Description": "There is a boom for creating mobile applications, many of which are alternatives to websites. This means that good QA is needed for end-to-end testing of these apps. Robot Framework users may combine it with AppiumLibrary and Appium.\r\n\r\n<br>\r\n\r\nWith Robot’s layer of abstraction, tests for mobile can be written in a similar way to webtesting. While that should make it easier, it is not as easy. There are additional challenges like device management, and test coverage of different models and OS versions. Complexity increases when the same tests need to be executed on multiple mobile platforms, without too much duplicate code.",
    "Duration": 420,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["7QVJRP", "RVHTR8", "ZZASJX"],
    "Speaker names": ["Gaja Kochaniewicz", "Juuso Tamminen", "Severi Casserly"],
    "Room": {
      "en": "Mobile application testing with Robot Framework"
    },
    "Start": "2024-02-06T07:00:00+00:00",
    "End": "2024-02-06T16:00:00+02:00",
    "Lessons Learned": "The goal of the workshop is helping all attendees to gain a new or improved understanding of mobile testing. This includes topics of automated setup of testing environments, usage of Appium with Robot Framework, differences between Android and iOS as testing platforms, creation of reusable test cases that can run on multiple platforms.\r\nAttendees are welcome to raise issues, and discuss solutions.",
    "Describe your intended audience": "This workshop is aimed at technical people, experienced with Robot Framework and scripting (bash or similar). Experience with mobile application development and beginner experience in testing mobile apps is a plus, but not required. Attendees should be ready to code. Most of the time will be spent doing hands-on testing with guidance of experienced trainers.",
    "Is this suitable for ..?": "Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "UNNGNM",
    "Proposal title": "Panel Discussion (Live)",
    "Session type": {
      "de": "Keynote",
      "en": "Keynote"
    },
    "Track": null,
    "Abstract": "Joe will interview the expert panel about Robot Framework, its capabilities and its community.",
    "Description": "Joe will interview an expert panel about the Robot Framework, discussing its capabilities and the community surrounding it.\r\n\r\nThe panel members, who are esteemed experts in the Robot Framework, will be announced soon.\r\n\r\nKnown for his engaging style, Joe is sure to facilitate a conversation that is both cheerful and insightful. We're looking forward to a fun and informative session!",
    "Duration": 50,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": [],
    "Speaker names": [],
    "Room": {
      "en": "RoboConOnline"
    },
    "Start": "2024-02-29T18:00:00+00:00",
    "End": "2024-02-29T21:00:00+02:00",
    "Lessons Learned": "Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.",
    "Describe your intended audience": null,
    "Is this suitable for ..?": "Advanced RF user"
  },
  {
    "ID": "VHSLZ8",
    "Proposal title": "The Vital Divide: Developers And TA Specialists in Test Automation",
    "Session type": {
      "en": "PreRecorded-Talk"
    },
    "Track": null,
    "Abstract": "Are developers able to write automated tests and should they do it? And if so, in what sense, in which areas, and to what extent? Let us take a closer look at the symbiosis of developers and test automation specialists and explore why keeping they roles separate is the key to unlocking the potential of a testing process.",
    "Description": "In software development, the question of the developer's role in automated testing and that of the test automation specialist in development occasionally arises. We will take a thought-provoking look at this complex relationship in our talk.\r\n\r\nThis question considers the overlap and similarities between their personalities and roles; however, differences do exist. While developers may possess the technical ability to create functional automated tests, test automation encompasses more than merely writing automatic tests, just as development involves more than coding an application. The skill sets of the two groups differ significantly: developers require extensive technical knowledge, while testers need to empathise with users or customers, understanding their needs and behaviour, business processes, and use cases. They require different mindsets: technically oriented versus customer-oriented, constructive versus critical, and synthetic versus analytical. (It is no coincidence that developers tend to focus on positive, happy-day scenarios, whereas testers usually discover negative ones.) \r\n\r\nIt is therefore difficult to envisage a centaur, part tester and part developer, possessing these contrasting skills and mindsets. What is beyond imagination is this creature not being overwhelmed by its workload and receiving fair remuneration. However, the attitudes and skills of both developers and TA specialists are critical to the development of high-quality software, and thus not only performing tasks of the ones and the others but also maintaining a clear distinction between these two groups appears to be vital. Their collaboration is undoubtedly essential and, fortunately, also feasible as long as both parties strive to understand each other's inherently different personalities and attitudes while respecting each other's expertise. Their shared focus on a common goal and areas of their knowledge that overlap can also be immensely beneficial.\r\n\r\nJoin us as we explore the intricacies of these fascinating species, find the optimal way for them to collaborate symbiotically, and consider how their interplay can enhance both your development process and its outcomes.",
    "Duration": 20,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["UTWEES"],
    "Speaker names": ["Václav Fuksa"],
    "Room": {
      "en": "RoboConOnline"
    },
    "Start": "2024-02-28T17:00:00+00:00",
    "End": "2024-02-28T19:20:00+02:00",
    "Lessons Learned": "The audience will gain an insight into the similarities and differences between developers and test automation specialists and, therefore, obtain a better understanding of the qualities of the opposing camps. They will learn why blending their roles is harmful, how the collaboration between them is possible, and why it is critical to the quality of the software under test. Test automation specialists in the audience should take away a greater professional self-esteem.",
    "Describe your intended audience": "Everyone who has dealings with creating automated functional tests, including developers (i.e. totally everyone in the audience :))",
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "WKP7CT",
    "Proposal title": "Our QA Transformation Journey from Manual tests to using Robot Framework for E2E tests",
    "Session type": {
      "en": "PreRecorded-Talk"
    },
    "Track": null,
    "Abstract": "A part of our QA Transformation Journey was Test Automation, where we learned about Robot Framework, and we realized that this is a perfect tool for our end-to-end (E2E) testing during the User Acceptance Testing (UAT) period. The manual tests for our E2E involved the initial tests on a handheld device, followed by a web portal and TA system",
    "Description": "A part of our QA Transformation Journey was Test Automation, where we learned about Robot Framework, and we quickly realized that this is a perfect tool for our end-to-end (E2E) testing during the User Acceptance Testing (UAT) period. The manual tests for our E2E involved the initial tests on a handheld device, followed by a web portal and our TA system. By utilizing Robot Framework with Appium, Browser, and RemoteSwingLibrary, we were able to incorporate three different technologies into a single E2E test suite. This provided us with more time for testing new functionality and conducting exploratory testing. \r\n\r\nI will provide a walkthrough for the manual test, followed by a demo where we can observe Robot Framework performing E2E automated tests.",
    "Duration": 20,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["XXC8JB"],
    "Speaker names": ["Tanja Poposka"],
    "Room": {
      "en": "RoboConOnline"
    },
    "Start": "2024-02-28T16:30:00+00:00",
    "End": "2024-02-28T18:50:00+02:00",
    "Lessons Learned": "Lessons learned that, even though we were new to using Robot Framework, we discovered a domain where we could incorporate these techniques and derive value. In this case, it was for our end-to-end (E2E) testing during User Acceptance Testing (UAT) or when we had a deployment that required testing within a limited timeframe. With Robot Framework handling our E2E tests, it provided the quality assurance we needed.\r\n\r\nSome members of our QA team were new to Robot Framework, but they managed to learn this framework quickly.",
    "Describe your intended audience": null,
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user"
  },
  {
    "ID": "XFZ7KM",
    "Proposal title": "The Power of Community",
    "Session type": {
      "de": "Keynote",
      "en": "Keynote"
    },
    "Track": null,
    "Abstract": "The Robot Framework Community seen through the eyes of our community members.",
    "Description": "We, members of the Robot Framework community, will talk about the Robot Framework community's collaborative spirit, emphasizing the importance of mutual help and diverse contributions. We'll highlight how each member's unique skills enhance the community, from technical knowledge to mentorship.\r\n\r\nIn addition we will share our experiences, demonstrating the community's strength through collaboration and support. This session will celebrate the collective wisdom of the Robot Framework community, encouraging active participation and showcasing how combined efforts lead to significant advancements.",
    "Duration": 30,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["GBZFGS"],
    "Speaker names": ["Merel, Guido, Manana, Kelby and Yuri"],
    "Room": {
      "en": "RoboCon"
    },
    "Start": "2024-02-08T08:55:00+00:00",
    "End": "2024-02-08T11:25:00+02:00",
    "Lessons Learned": "What is the Robot Framework community?\r\nHow to engage with the community?\r\nInspiring stories about actual life.",
    "Describe your intended audience": null,
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "XH9APF",
    "Proposal title": "Do Robots Dream of Pickled Cucumbers? Gherkin with RobotFramework",
    "Session type": {
      "en": "Talk"
    },
    "Track": null,
    "Abstract": "Explore an innovative approach to executing Gherkin/Cucumber scenarios within the Robot Framework using a new custom parser. This talk delves into the technical intricacies of this integration, emphasizing the distinctions between Gherkin/Cucumber and Robot Framework.",
    "Description": "In my presentation, we will dive into the fascinating realm of test automation, unveiling an innovative approach to executing Gherkin/Cucumber scenarios within the Robot Framework. Leveraging a custom parser developed specifically for this purpose, we overcome traditional challenges, seamlessly integrating the clear, human-readable Gherkin/Cucumber test specifications with the robustness of the Robot Framework.\r\n\r\n**Agenda:**\r\n\r\n1. **Introduction to Gherkin/Cucumber:** We begin with an explanation of the Gherkin/Cucumber language and its role in Behavior-Driven Development (BDD).\r\n\r\n2. **Technical Insights into Robot Framework:** A thorough exploration of the technical aspects of the Robot Framework, emphasizing its adaptability in various automation scenarios.\r\n\r\n3. **Addressing the Challenge:** We examine the typical hurdles in integrating Gherkin/Cucumber into the Robot Framework and showcase how our custom parser overcomes these barriers.\r\n\r\n4. **Live Demonstration:** Experience a live demo showcasing how Gherkin/Cucumber scenarios are effortlessly executed within the Robot Framework, with the custom parser transforming natural language into executable tests.\r\n\r\n5. **Practical Use Cases:** We examine real-world applications that illustrate how this integration works in practice, optimizing test processes and enhancing team collaboration.\r\n\r\n6. **Future Developments:** A glimpse into planned features, developments, and opportunities for further refinement of this integrative solution.",
    "Duration": 30,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["RMY3KA"],
    "Speaker names": ["Daniel Biehl"],
    "Room": {
      "en": "RoboCon"
    },
    "Start": "2024-02-08T10:10:00+00:00",
    "End": "2024-02-08T12:40:00+02:00",
    "Lessons Learned": "Participants will learn how to seamlessly integrate Gherkin/Cucumber scenarios into the Robot Framework. They will discover solutions to integration challenges, witness a live demonstration of the custom parser in action, and gain practical insights to enhance collaboration, optimize test automation, and prepare for future developments.",
    "Describe your intended audience": null,
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "YF7RXZ",
    "Proposal title": "Database Library update",
    "Session type": {
      "en": "Talk"
    },
    "Track": null,
    "Abstract": "The [Database Library](https://github.com/MarketSquare/Robotframework-Database-Library/) for Robot Framework has been finally updated - after a long break since 2019. Moreover, the library maintenance was transferred to the Robot Framework community. This talk gives an overview of last changes and library features in general.",
    "Description": "The purpose of the talk is to give an update of last changes in the Database Library, demonstrate a usage with a simple demo and call for a contribution, since the project was finally transferred to the community maintenance.",
    "Duration": 30,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["BJAPHL"],
    "Speaker names": ["Andre Mochinin"],
    "Room": {
      "en": "RoboCon"
    },
    "Start": "2024-02-09T13:20:00+00:00",
    "End": "2024-02-09T15:50:00+02:00",
    "Lessons Learned": "The participants will learn, how to use the Database Library and what are the last changes in the project.\r\nFurthermore, they should learn that the library is under active maintenance again and can be used more actively.",
    "Describe your intended audience": null,
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "YLX3LV",
    "Proposal title": "Fuzzing for vulnerabilities in REST APIs",
    "Session type": {
      "en": "Talk"
    },
    "Track": null,
    "Abstract": "The existence of REST APIs itself is a security threat, as easy programmable APIs are also an easy target for attackers. Often, they lack sufficient security design or testing. Learn about Vaisala's experience of integrating API fuzzing - a form of security testing - into existing RF automated testing and the results that came with it.",
    "Description": "<p>REST APIs are a common and attractive attack vector. Often they lack sufficient security design or security testing. It is common to rely a bit too much on client-side sanitization while neglecting the idea of direct API usage. This can cause a lot of security issues, like sensitive data exposure, broken authentication, and injection attacks. </p>\r\n <p>So, how can we make sure an API cannot be exploited? The answer is to fuzz it. In this talk, you learn about Vaisala's experience of integrating API fuzzing - a form of security testing - into an existing Robot Framework system test automation process for one of company products. </p> \r\n<p>We selected a third-party tool (Schemathesis, which builds on the property-based testing library Hypothesis) and implemented a Python package with post-processing functionality that allows us to effectively run fuzzing against our APIs. This Python package is then imported and used in RF test cases. </p> \r\n<p>Since fuzzing can generate a lot of noise, because of its randomness, the post-processing step can validate the meaning of symptoms and help us make sense of test results better by integrating with existing robot framework automation assets. So when a bug is found with fuzzing, we can rerun the faulty test, and run any system checks we need, which will tell us what exactly is broken. </p>\r\n <p>Overall, the talk explains how REST API fuzzing can be effectively integrated with existing RF tests, and shows examples of found problems.</p>",
    "Duration": 30,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["T9BAF3"],
    "Speaker names": ["Alina Kostetska"],
    "Room": {
      "en": "RoboCon"
    },
    "Start": "2024-02-08T14:10:00+00:00",
    "End": "2024-02-08T16:40:00+02:00",
    "Lessons Learned": "The participants will learn about:\r\n\t- why REST APIs can be dangerous\r\n\t- what is fuzzing, and why one would want to use that\r\n\t- a technique for REST API fuzzing used in a Vaisala's project:\r\n\t\t- creating a Python package based on Schemathesis to use with Robot Framework\r\n\t\t- fuzzing using the package\r\n\t\t- post-processing that reuses existing test cases - to identify the reason for a bug\r\n\t\t- examples of found bugs",
    "Describe your intended audience": "People interested in automating security testing; \r\nPeople working with REST APIs;",
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user"
  },
  {
    "ID": "YSA8HK",
    "Proposal title": "How to Be a Robot Framework Champion: Collaborative Workshop",
    "Session type": {
      "en": "Workshop - Full Day"
    },
    "Track": null,
    "Abstract": "Introducing Robot Framework in an organization can be challenging and complex. This workshop will help you overcome the challenges and leverage the benefits. You will collaborate with other testers and test automators who share similar goals and experiences. We will play games, role-play scenarios, and document the whole process for the community.",
    "Description": "Welcome to the workshop on “How to Be a Robot Framework Champion: Collaborative Workshop”. My name is Adam Hepner, and I am a QA Lead at Nice Project. I am also championing the introduction of Robot Framework at Heidelberger Druckmachinen AG, a German company that provides products and services for the printing industry.\r\n\r\n<br>\r\n\r\nIn this workshop, I will share with you my experience and insights on how to introduce Robot Framework in your organization. Robot Framework is a tool that you already know and use, so I will not spend time explaining what it is or how it works. Instead, I will focus on the challenges and benefits of introducing it as a main end-to-end testing tool in your workplace.\r\n\r\n<br>\r\n\r\nThe workshop will be divided into 7 time blocks (give-or-take), each focusing on a different topic or theme related to introducing Robot Framework in an organization. The topics will include:\r\n\r\n<br>\r\n\r\n- Why Robot Framework should be used? What are its pros and cons and how does it compare to other tools?\r\n- Where can Robot Framework be used? Where cannot it be used?\r\n- What do developers and testers prefer to Robot Framework and why?\r\n- How can introduction be approached? What are the best practices and pitfalls to avoid?\r\n- How can Robot Framework be integrated with other tools, such as Selenium, BrowserStack, or Jenkins?\r\n- How can Robot Framework be used for different types of testing, such as acceptance testing, functional testing, or performance testing?\r\n\r\nThe workshop will use a combination of theory and practice, with an emphasis on discussion and collaboration. I hope to pass on my experience, and at the same time - learn from You. \r\n\r\nWe will also be:\r\n\r\n- Playing games, such as risk storming with test sphere card game or the pipeline game, that will help you explore different aspects of introducing Robot Framework in an organization, such as identifying the quality aspects, the risks, the test strategies, and the pipeline design.\r\n- Role-playing scenarios, such as convincing a skeptical manager or developer to adopt Robot Framework, that will help you practice your communication and persuasion skills and understand the opinions and preferences of others.\r\n- Authoring a documentation as a guide for future technical experts, that will help you summarize and document the main points and outcomes of the workshop.\r\n\r\nThis workshop will be driven by its participants, so the topics can vary slightly, but you're more than welcome to bring your ideas and experience to the table!",
    "Duration": 420,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["AQXFCJ"],
    "Speaker names": ["Adam Hepner"],
    "Room": {
      "en": "How to Be a Robot Framework Champion: Collaborative Workshop"
    },
    "Start": "2024-02-06T07:00:00+00:00",
    "End": "2024-02-06T16:00:00+02:00",
    "Lessons Learned": "(to be added later, but you probably get the idea)",
    "Describe your intended audience": null,
    "Is this suitable for ..?": "Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "ZAGHBH",
    "Proposal title": "I don't always test my code but when I do I do it in production",
    "Session type": {
      "en": "PreRecorded-Talk"
    },
    "Track": null,
    "Abstract": "People usually think that testing is something that happens only test environment, but real world does not stand still. Therefore testing  also in production is vital in fast paced modern world.",
    "Description": "I don't always test my code but when I do I do it in production, or how it should go? talk describes what benefits testing in production can bring to people in different sized teams. In real world everything changes always and all the time. We as testers and developers cannot control those changes, but those changes can, and some point will affect our products and customers. Because there is so many changes happening all the time, this talks highlights why testing is important in different type of environments and different stages of the software life cycle.\r\nModern agile talks about moving testing to left, closer to the development and moving testing to the left is the correct move to do. But many teams forget that instead of moving testing only to the left, teams should also move testing the right: do testing in production. This presentation talks what benefits testing in production can bring to small open-source developer like me. Talk provides examples from my life as open-source developer and from projects like [Browser](https://github.com/MarketSquare/robotframework-browser) and [AssertionEngine](https://github.com/MarketSquare/AssertionEngine). Also presentation covers how those techniques can be applied to large scale enterprise applications.",
    "Duration": 20,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["8HSX9A"],
    "Speaker names": ["Tatu Aalto"],
    "Room": {
      "en": "RoboConOnline"
    },
    "Start": "2024-02-29T13:30:00+00:00",
    "End": "2024-02-29T15:50:00+02:00",
    "Lessons Learned": "Many teams may just develop software and throw the software to a deployment and monitoring teams. If they do that, teams will miss lot of important feedback how their system work and what problems user may face. This talk tells that testing also production is important and what benefits it will bring to the teams. Also testing in production is not same in testing in CI environment, but how/why CI system can be used to test in production.",
    "Describe your intended audience": "Anyone who is interested to for being part of successful team. Developer, tester, product owner or anyone who is part of the development process.",
    "Is this suitable for ..?": "Beginner RF user, Intermediate RF user, Advanced RF user"
  },
  {
    "ID": "ZMRYQP",
    "Proposal title": "Orchestrating Robot Framework: From the Louvre to Kubernetes with Terraform & Ansible",
    "Session type": {
      "en": "PreRecorded-Talk"
    },
    "Track": null,
    "Abstract": "This talk unveils 'Cloud-Agnostic Auto-Scaling' in Robot Framework, leveraging Kubernetes, Terraform, Ansible, Prometheus & Grafana. A live demo of real-time scaling across multiple clouds via K8s. Dive into observability with Prometheus metrics and Grafana dashboards. This session offers a holistic, high-impact, & cost-efficient testing framework.",
    "Description": "# Cloud-Agnostic Auto-Scaling in Robot Framework\r\n\r\n## **Overview**\r\nThis session is a magnum opus on 'Cloud-Agnostic Auto-Scaling' within Robot Framework—crucial for professionals in test automation, cloud computing, and DevOps.\r\n\r\n## **Agenda**\r\n\r\n### **Introduction (3 minutes)**\r\n- Importance of 'Cloud-Agnostic Auto-Scaling' in Robot Framework for today's fast-paced DevOps world.\r\n\r\n### **Why Robot Framework Needs Scaling in Modern DevOps (4 minutes)**\r\n- Discuss the critical role of scalability in meeting the real-time demands of continuous integration and deployment.\r\n- **Case Study**: A real-world example where scaling Robot Framework tests reduced execution time from 8 hours to less than 60 minutes, accelerating the DevOps pipeline.\r\n\r\n### **Software Components That Make Scaling Possible (5 minutes)**\r\n- **Kubernetes**: Enables auto-scaling and self-healing features for optimal resource use.\r\n- **Terraform**: Automates infrastructure provisioning, facilitating rapid scaling.\r\n- **Ansible**: Manages automated configuration, essential for quick scaling.\r\n- **Prometheus**: Captures real-time metrics and alerts, supporting auto-scaling.\r\n- **Grafana**: Provides rich analytics and visualization, including alerts for scaling activities.\r\n\r\n### **Live Demo (6 minutes)**\r\n- Showcase both vertical scaling (reallocating resources) and horizontal scaling (modifying Robot Framework pods). Orchestrated by Terraform and Ansible, monitored by Prometheus and Grafana.\r\n\r\n### **What Is the Takeaway? (2 minutes)**\r\n- Gain insights on how to implement this robust, scalable, and observable framework in your organization.\r\n\r\n### **Who Should Attend? (2 minutes)**\r\n- QA Engineers, DevOps practitioners, CTOs, and decision-makers.\r\n\r\n### **Q&A (2 minutes)**\r\n- Open floor for audience queries.\r\n\r\n### **Conclusion (1 minute)**\r\n- Final thoughts and an invitation for further collaboration.",
    "Duration": 20,
    "Slot Count": 1,
    "Language": "en",
    "Session image": "",
    "Speaker IDs": ["9J9TZ3"],
    "Speaker names": ["Babu Manickam"],
    "Room": {
      "en": "RoboConOnline"
    },
    "Start": "2024-02-28T12:00:00+00:00",
    "End": "2024-02-28T14:20:00+02:00",
    "Lessons Learned": "Here are my views towards the lessons learned (I understand considering the time limit of 25 minutes - this can be challenging but guaranteed to do the best):\r\n\r\n1. Kubernetes: Participants will learn how to utilize Kubernetes for real-time auto-scaling and self-healing, essential for optimal resource usage in Robot Framework.\r\n2. Terraform: An in-depth look at how Terraform can programmatically set up the required infrastructure, making the scaling process efficient and reproducible.\r\n3. Ansible: A focus on automated configuration to enable quick scaling up or down, streamlining the automation process.\r\n4. Prometheus: Techniques to leverage Prometheus for real-time metrics, supporting not just auto-scaling but also custom alerting based on metrics.\r\n5. Grafana: Insights into creating intuitive dashboards for better analytics and visualization, including setting up scaling alerts.\r\n\r\nLive Demo: A hands-on demonstration on scaling Robot Framework tests both vertically (by reallocating resources) and horizontally (by increasing/decreasing the number of Robot pods).\r\n\r\nBest Practices & Lessons Learned\r\n\r\nCase Study: A real-world example will be discussed where the practices mentioned reduced the test execution time from 8 hours to less than 60 minutes. This highlights the immediate benefits in a DevOps cycle.\r\n\r\nTakeaways\r\n#1 A robust framework to implement auto-scaling in Robot Framework tests, irrespective of the cloud service provider.\r\n#2 Proven strategies and code snippets for immediate implementation.\r\n\r\nBy attending this session, participants will not just grasp the theoretical underpinnings but will gain practical, hands-on knowledge that can be immediately applied to their own DevOps and testing environments.",
    "Describe your intended audience": "1. QA Engineers: Those who are already working with Robot Framework or are looking to implement scalable test automation will find this session particularly useful.\r\n\r\n2. DevOps Practitioners: Professionals who are involved in CI/CD pipeline configurations and are looking to enhance scalability and resource optimization will gain invaluable insights.\r\n\r\n3. CTOs and Decision-Makers: Executives looking for strategic ways to improve resource utilization, speed up development cycles, and optimize costs should attend to understand how these technologies can impact ROI.\r\n\r\n4. Academicians and Students: Anyone in academia interested in cutting-edge DevOps practices and test automation scalability.\r\n\r\nThis session is designed to offer valuable insights to both technical and managerial roles. The content will range from hands-on code snippets to high-level strategies, making it a must-attend for a wide spectrum of professionals.",
    "Is this suitable for ..?": "Intermediate RF user, Advanced RF user"
  }
]
